[
  {
    "title": "Harley Quinn and The Joker: Sound Mind",
    "link": "0LwynFnRBJBHaZRdkqC9fc",
    "meta": {
      "rank": 1,
      "category": "Fiction",
      "publisher": "Warner Bros. / Spotify Studios ",
      "description": "Dr. Harleen Quinzel (Christina Ricci) is fresh out of grad school--a new psychologist at Arkham Asylum determined to help the patients her colleagues have written off. But her dad is sick and in need of an expensive, life-saving operation she can’t afford. When she meets “Patient J” (Billy Magnussen), a magnetic criminal able to manipulate everyone but her, Harleen makes a fateful decision leading her and The Joker down a dangerous path that will change Gotham City and Bruce Wayne (Justin Hartley) forever. Harley Quinn and The Joker: Sound Mind is created by Eli Horowitz and was produced by Realm in association with Blue Ribbon Content and DC for Spotify Studios.",
      "image": "https://i.scdn.co/image/ab67656300005f1f423b8ad8e1fdf5b7f7208b90",
      "velocity": 0
    }
  },
  {
    "title": "The Royals of Malibu",
    "link": "64KjaUllMlXkk11mFPU3rT",
    "meta": {
      "rank": 2,
      "category": "Fiction",
      "publisher": "Diversion",
      "description": "Ella Sinclair (Alyssa McKay) is a survivor. She's fierce, brave, and jaded. She finds herself a teenage orphan trying to stay afloat and finish high school on her own. Enter The Royals. Through circumstances Ella can barely believe, wealthy father-of-two sons, Callum Royal, plucks Ella out of poverty and welcomes her into their posh lifestyle a world away in elegant Malibu. Even though both Royal boys are intriguing, the most magnetic is the oldest, Reed Royal. Reed seems determined to keep Ella from settling comfortably into her new charmed life amongst the rich kids of Malibu. But what is Reed hiding? Ella is just as determined to come through it all with her soul intact. New episodes every Monday.  Follow The Royals of Malibu on Instagram Follow The Royals of Malibu on TikTok Explore more: diversionaudio.com ",
      "image": "https://i.scdn.co/image/ab67656300005f1f72fc586badd2d5c5870c4e97",
      "appleId": "id1658147728",
      "ratings": 842,
      "velocity": 0
    }
  },
  {
    "title": "Worlds Beyond Number",
    "link": "4xQ4HKZjIg04Phtj2gaTbi",
    "meta": {
      "rank": 3,
      "category": "Fiction",
      "publisher": "Fortunate Horse, Worlds Beyond Number",
      "description": "Brennan Lee Mulligan, Erika Ishii, Aabria Iyengar, and Lou Wilson hang out together and use games to make up stories. It's pretty good.",
      "image": "https://i.scdn.co/image/ab67656300005f1f416214c11e2a0ba4efa4782c",
      "appleId": "id1663678491",
      "ratings": 24,
      "velocity": 0
    }
  },
  {
    "title": "Scary Horror Stories by Dr. NoSleep",
    "link": "2Sqi0dJoIudYWq430DXRH5",
    "meta": {
      "rank": 4,
      "category": "Fiction",
      "publisher": "Dr. NoSleep",
      "description": "The most terrifying horror stories on the internet. New stories weekly. Click follow to receive all notifications. 🔔  🎥 YouTube channel: https://youtube.com/c/DrNoSleep  🎉 Ad-free episodes + bonus episodes: patreon.com/DrNoSleep  👕 Dr. NoSleep Merchandise: drnosleep.com  ✅ Advertising Inquiries: This podcast is represented by True Native Media. Email all advertising inquiries to info@truenativemedia.com.  📈 Business Inquiries: business@drnosleep.com  * * *  EXPLICIT CONTENT DISCLAIMER: This podcast contains explicit content intended for adults 18 years of age or older. These stories are NOT intended for children under the age of 18. Parental guidance is strongly advised for children under the age of 18. Listener discretion is advised.  COPYRIGHT WARNING: The use of any affiliated audio of these episodes is not allowed, as it is a direct violation of copyright law and will result in legal action.   Copyright © 2023 Dr. NoSleep   #drnosleep #horrorstories #scarystories #doctornosleep #horror #horrorpodcast #scary",
      "image": "https://i.scdn.co/image/ab67656300005f1f9dc949bf5c647b10d73acfe8",
      "appleId": "id1501406448",
      "ratings": 1517,
      "velocity": 0
    }
  },
  {
    "title": "Batman Unburied",
    "link": "3pUWoZ6fC2qA02D3X0CeMb",
    "meta": {
      "rank": 5,
      "category": "Fiction",
      "publisher": "Warner Bros. / Spotify Studios ",
      "description": "Explore in more languages. A serial killer known as The Harvester terrorizes Gotham City, but Batman is not coming to the rescue. In fact, Bruce Wayne has no memory of being the Caped Crusader at all. Instead, Bruce is a forensic pathologist, performing the autopsy on the latest victim when he’s attacked by the killer himself. As Bruce’s obsession with the Harvester consumes him, Dr. Thomas Wayne, head of Gotham City Hospital, orders his son to take medical leave and seek treatment from an unusual psychologist, Dr. Hunter. With Batman missing in action, Detective Barbara Gordon is left with no other choice but to seek help from Gotham’s second smartest detective: The Riddler. Batman Unburied is created by David S. Goyer and stars Winston Duke, Hasan Minhaj, and Gina Rodriguez. Batman Unburied was produced by Phantom Four & Wolf at the Door in association with Blue Ribbon Content and DC for Spotify.New Episodes every Tuesday. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f99f7b76bd4298ab0b3cee2a6",
      "velocity": 0
    }
  },
  {
    "title": "Welcome to Night Vale",
    "link": "0s6Wc5qf8SIvCtKZNC6N7s",
    "meta": {
      "rank": 6,
      "category": "Fiction",
      "publisher": "Night Vale Presents",
      "description": "Twice-monthly community updates for the small desert town of Night Vale, where every conspiracy theory is true. Turn on your radio and hide. Never listened before? It's an ongoing radio show. Start with the current episode, and you'll catch on in no time. Or, go right to Episode 1 if you wanna binge-listen.",
      "image": "https://i.scdn.co/image/d36f8d13d81c8e631c369fb004cf4381568dfe77",
      "followers": 343281,
      "appleId": "id536258179",
      "ratings": 25320,
      "velocity": 0
    }
  },
  {
    "title": "The Sleepy Bookshelf: Audiobooks for Sleep",
    "link": "0Jj6DoEoG2R5fWdIEbZ0bd",
    "meta": {
      "rank": 7,
      "category": "Fiction",
      "publisher": "Slumber Studios",
      "description": "Fall asleep to classic works of fiction, adapted and narrated to help you relax. Each episode begins with a brief moment of relaxation followed by a quick summary of the prior episode. That way, you can fall asleep whenever you're ready and always stay caught up.   Explore our full library of over 30 audiobooks. There is something for everyone!  Support our show as a premium member and get access to bonus episodes and ad-free listening.",
      "image": "https://i.scdn.co/image/ab67656300005f1f41e1d1391853496b0107690b",
      "appleId": "id1573623902",
      "ratings": 2300,
      "velocity": 0
    }
  },
  {
    "title": "Dangerously Yours",
    "link": "6fKWtukLYeRUsPCZrhQR7O",
    "meta": {
      "rank": 8,
      "category": "Fiction",
      "publisher": "Classic Radio Shows",
      "description": "Dangerously Yours was a half hour show sponsored by Vicks. There were sixteen episodes broadcast in 1944, with eleven of them available to collectors today. Each episode seemed to star Victor Jory as the leading man, and concentrated heavily on romance, with much airtime being devoted to lovers murmuring sweet nothings at each other, and the action and adventure being relegated to backdrop status. At the end of each episode, the announcer would give a very brief teaser for the following week's show.Listen to our radio station Old Time Radio https://link.radioking.com/otradioListen to other Shows at My Classic Radio https://www.myclassicradio.net/Podcast Service I Recommend https://redcircleinc.grsm.io/entertainmentradio7148Remember that times have changed, and some shows might not reflect the standards of today’s politically correct society. The shows do not necessarily reflect the views, standards, or beliefs of Entertainment Radio",
      "image": "https://i.scdn.co/image/ab67656300005f1f820bbe213b04c8808033a400",
      "appleId": "id1653467248",
      "ratings": 59,
      "velocity": 0
    }
  },
  {
    "title": "Scare You To Sleep",
    "link": "2sNFsS8B0qvIg1jK0Vo7Ns",
    "meta": {
      "rank": 9,
      "category": "Fiction",
      "publisher": "Bloody FM",
      "description": "Curl up and relax as I read you a spooky bed time story! Join me in enjoying the soothing, although somewhat unnerving, sounds of all that goes bump in the night.From ghosts in the bayou to serial killers in the 90s, we've got everything you need to be scared to sleep! Get bonus content on Patreon Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9d0010ab46398b42c023835f",
      "followers": 231,
      "appleId": "id1585943594",
      "ratings": 231,
      "velocity": 0
    }
  },
  {
    "title": "Case 63 ",
    "link": "4c9ZKaFtEKweSYOlYvxfvp",
    "meta": {
      "rank": 10,
      "category": "Fiction",
      "publisher": "Gimlet",
      "description": "New York psychiatrist Dr. Eliza Knight (Academy Award winner Julianne Moore) begins treating a patient registered as Case 63 (Emmy nominee Oscar Isaac) who claims to be from the year 2062. What begins as routine therapeutic sessions quickly turns into a story that threatens the boundaries of the possible and the real. Out now. Follow & listen for free Only On Spotify. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f0d9b0b7500c69c18816d51f8",
      "velocity": 0
    }
  },
  {
    "title": "Batman: The Audio Adventures",
    "link": "6YOANXuJ8AAtB2bFilDm6g",
    "meta": {
      "rank": 11,
      "category": "Fiction",
      "publisher": "HBO Max",
      "description": "In partnership with Warner Bros. and DC, this scripted audio original, Gotham City comes to lurid life in the theater of your mind…with a sensational pageant of technicolor villainy unlike any other on Earth. Mafioso Penguins. Thieving Catwomen. Terrorist Riddlers. Killing Jokers…a city where some problems can only be solved by a billionaire in a bat costume. Starring Jeffrey Wright as Batman, Rosario Dawson as Catwoman, John Leguizamo as the Riddler, and a who’s who of incredible “Saturday Night Live” alums, the series draws inspiration from the vintage noir atmosphere of the celebrated “Batman: The Animated Series,” the spirited fun of the classic 1960s “Batman” TV series, and the entire 80-plus year history of the BATMAN franchise. This rollicking, over the top Batman adventure is written and directed by Emmy®-winner Dennis McNicholas, features an A-List cast, and devilishly delightful original music.",
      "image": "https://i.scdn.co/image/ab67656300005f1f42f2e94bdefbcec1bf463bd5",
      "appleId": "id1585025879",
      "ratings": 617,
      "velocity": 0
    }
  },
  {
    "title": "Relatos de la Noche",
    "link": "0SAv0bEYhFndhLODSzPIfL",
    "meta": {
      "rank": 12,
      "category": "Fiction",
      "publisher": "Sonoro | RDLN",
      "description": "En la tradición de los clásicos de la radio, aquí se cuentan las historias, relatos y leyendas que habitan las calles de México e Iberoamérica.  ",
      "image": "https://i.scdn.co/image/ab67656300005f1f04e7924d604e8d740b9da8a9",
      "appleId": "id1526507264",
      "ratings": 986,
      "velocity": 0
    }
  },
  {
    "title": "X-Men: The Audio Drama",
    "link": "2r42lc4yvsB2E7jy8kZ1HR",
    "meta": {
      "rank": 13,
      "category": "Fiction",
      "publisher": "Karl Dutton",
      "description": "X-Men The Audio Drama retells the adventures of the Uncanny X-Men from the very beginning, using the comic book history and stories as a template while retelling and modernizing the tales. Season One told the classic stories of the \"First Class,\" Season Two now delves into the \"All New, All Different\" era.",
      "image": "https://i.scdn.co/image/ab67656300005f1f00554b408d652c7ff63b74fb",
      "appleId": "id902813725",
      "ratings": 553,
      "velocity": 0
    }
  },
  {
    "title": "Bridgewater",
    "link": "7aTEmK0Vvwa5L4ZKBsmPyJ",
    "meta": {
      "rank": 14,
      "category": "Fiction",
      "publisher": "iHeartPodcasts and Grim & Mild",
      "description": "When a relic from his past is rediscovered, folklore professor Jeremy Bradshaw puts his life on hold to solve the mystery. Along the way, he’s helped by people who challenge everything he believes in, and ultimately tries to answer the question: can the past be rewritten? A supernatural thriller for your ears, starring Misha Collins, Melissa Ponzio, and Alan Tudyk. Created by Aaron Mahnke and written by Lauren Shippen.",
      "image": "https://i.scdn.co/image/ab67656300005f1f76b7fd614c5d88e7de885258",
      "followers": 4969,
      "appleId": "id1574751423",
      "ratings": 4969,
      "velocity": 0
    }
  },
  {
    "title": "SCP Archives",
    "link": "72aUDFGFu1acKQ6noDj7Fm",
    "meta": {
      "rank": 15,
      "category": "Fiction",
      "publisher": "Bloody FM",
      "description": "Secure. Contain. Protect. There are things that go bump in the night. Fantastic things. Horrible things. Redacted things. The SCP Foundation was built to keep humanity safe from a world of beings it doesn’t want to know exists. Things of wonder. Things of destruction. And these things have files. A LOT of files. New episodes weekly. * * * Content related to the SCP Foundation, including these podcasts, are licensed under Creative Commons Sharealike 3.0. Concepts originate from works on the SCP Foundation Wiki Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f61955c2d9fc4983b1f5f0f69",
      "followers": 4478,
      "appleId": "id1453436915",
      "ratings": 1327,
      "velocity": 0
    }
  },
  {
    "title": "nsfw asmr~",
    "link": "2EmY3peoBPMvkfV7UMHVq0",
    "meta": {
      "rank": 16,
      "category": "Fiction",
      "publisher": "🤍Sussy Mari🤍",
      "description": "hi hi this is my first podcast this is not sfw so listen at your own risk but anyway i hope you enjoy~ credits : Azeru official, seikyuu va, and yagami yato this is mostly all azeru and scaramouche bc he's babygurl i'll probably do more not sure yet but be sure to support all these amazing people and have a great day",
      "image": "https://i.scdn.co/image/ab67656300005f1f9a9ce519c7b2d718bcdca243",
      "velocity": 0
    }
  },
  {
    "title": "Mythology",
    "link": "1g056e2x0Y9AwW6CQF3qA5",
    "meta": {
      "rank": 17,
      "category": "Fiction",
      "publisher": "Parcast",
      "description": "Ancient myths, modern twists. This episodic audio drama brings history’s greatest stories to life, analyzing their origins and giving insight into how our ancestors saw the universe. Mythology is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1fec22075267b8b86c01cc5976",
      "followers": 534,
      "velocity": 0
    }
  },
  {
    "title": "Marvel's Wastelanders",
    "link": "2hxLOcOExR0S1NsaQXJuUz",
    "meta": {
      "rank": 18,
      "category": "Fiction",
      "publisher": "Marvel & SiriusXM",
      "description": "Wolverine, Black Widow, Star-Lord, Hawkeye, and Doctor Doom will team up to stop Valeria Richards. She is the smartest woman on Earth, immortal and lonely beyond reason. After surviving a rain of nuclear missiles in Southern California and gaining possession of the reality warping Cosmic Cube, she was driven to the brink of madness. Something mysterious is unfolding in this irradiated “Dead Zone” and it’s up to our heroes to find out what, and to stop Valeria from committing an act of ultimate evil.  Marvel's Wastelanders is the sixth and final installment in the “Marvel's Wastelanders” audio epic. Starring Dylan Baker as Doctor Doom, Timothy Busfield as Star-Lord, Stephen Lang as Hawkeye, Robert Patrick as Wolverine, and Susan Sarandon as Black Widow. Directed by Kimberly Senior. Original sound design by One Thousand Birds. Original music by Lindsay Jones. Story by Mark Waid. Written by Nick Bernardone, J Holtham, and Mark Waid. Learn more at marvel.com/wastelanders.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0e695af6fdf3f35efe2cc4fd",
      "followers": 17199252,
      "appleId": "id1657190283",
      "ratings": 113,
      "velocity": 0
    }
  },
  {
    "title": "Roads Go Ever On",
    "link": "6nqsJ6UHRA514RMdosr8wF",
    "meta": {
      "rank": 19,
      "category": "Fiction",
      "publisher": "Barrel Rider",
      "description": "The Lord of the Rings and The Hobbit written by J.R.R. Tolkien. Music composed by Howard Shore. The Lord of the Rings Soundscape Audiobook narrated, produced, and edited by Phil Dragash. The Hobbit Soundscape Audiobook narrated, produced, and edited by Bluefax. Art by Jian Guo.",
      "image": "https://i.scdn.co/image/ab67656300005f1fee67b612b42ab1a49bd683fa",
      "velocity": 0
    }
  },
  {
    "title": "Impact Winter",
    "link": "7nbgsDxyZjLGoqk66OUvfs",
    "meta": {
      "rank": 20,
      "category": "Fiction",
      "publisher": "Audible Originals",
      "description": "“They came after the impact and the firestorms. When the sun went dark. Like they’d been there all along. Just waiting.”From executive producers of The Walking Dead and Travis Beacham, the writer of Pacific Rim, comes a heart-stopping Audible Original featuring a brilliant British cast. It’s the near future and seven years since a comet hit the earth and blotted out the sun. The world is a dark, frozen landscape. And then, beastly creatures emerge and take over. Can they really be vampires?In the British countryside, a band of survivors forms a resistance in the fallout shelter of a medieval castle. Darcy is a battle-tested vampire hunter who is at the front line leading the charge to save humanity. Meanwhile, her younger sister Hope wants life to return normal so she can go above ground and know what it’s like to live again. And she just might be willing to risk it all.A story of apocalypse, horror, and adventure, Impact Winter is a wholly original new saga created just for Audible with immersive 3D audio that dares you to pop in your earbuds and listen in the dark. Venture into an eternally sunless world of swords and crossbows; primal hunters and shape-shifters; leaders and lovers. Hear how a brave few fight to survive the impact winter.Starring Liam Cunningham as Jepson Belgrave, Holliday Grainger as Darcy, Esme Creed-Miles as Hope, David Gyasi as Rook, Bella Ramsey as Whisper and Indira Varma as Kallistrata, Himesh Patel as Felix. Written, directed and executive produced by Travis Beacham. Also Executive Produced by Robert Kirkman, David Alpert, Rick Jacobs, Bryan Furst, Sean Furst and Alexandra August of Skybound Entertainment, Bard Dorros and Zack Hayden of Anonymous Content and Cliff Roberts. Executive producer for Audible was Matt Patterson.Associate Producer: Wes MazdaPlease note: This content is for mature audiences only. It contains adult language and themes. Discretion is advised.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0426ae740259f86852a44b9d",
      "appleId": "id1610213687",
      "ratings": 1089,
      "velocity": 0
    }
  },
  {
    "title": "Nazis: The Road to Power",
    "link": "0M3ioWXPLOTXuuGRRuxnrC",
    "meta": {
      "rank": 21,
      "category": "Fiction",
      "publisher": "BBC Radio 4",
      "description": "The story of how in just 13 years, Hitler led a fringe sect with less than a hundred members and outlandish ideas to be the dominant force in German politics.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd966a8021b64f9de0aa7105b",
      "appleId": "id1663190955",
      "ratings": 32,
      "velocity": 0
    }
  },
  {
    "title": "The Department of Variance of Somewhere, Ohio",
    "link": "5JpDOjf1UJQwAaAuvR2BwG",
    "meta": {
      "rank": 22,
      "category": "Fiction",
      "publisher": "Rat Grimes",
      "description": "A shady governmental group that deals with the supernatural experiences a containment breach at its main office. One new hire and one mid-level employee from the Bureau of Transnatural Resources are stuck on different floors when the lockdown begins. Not all is as it seems in the Department, however…  Go to somewhereohio.com for full cast information, transcripts, and more!",
      "image": "https://i.scdn.co/image/ab67656300005f1f9bac8b0332ad5573d76bc44d",
      "appleId": "id1657311153",
      "ratings": 30,
      "velocity": 0
    }
  },
  {
    "title": "The Adventure Zone",
    "link": "6OoAQesdLgYBOyfx8ji0bZ",
    "meta": {
      "rank": 23,
      "category": "Fiction",
      "publisher": "The McElroys",
      "description": "Justin, Travis and Griffin McElroy from My Brother, My Brother and Me have recruited their dad Clint for a campaign of high adventure. Join the McElroys as they find their fortune and slay an unconscionable number of ... you know, kobolds or whatever in ... The Adventure Zone..",
      "image": "https://i.scdn.co/image/ab67656300005f1f1e2e4c787d79cc3b188260f8",
      "appleId": "id947899573",
      "ratings": 34422,
      "velocity": 0
    }
  },
  {
    "title": "Old Gods of Appalachia",
    "link": "0rOkFpkORBFMEIHfV0YKzJ",
    "meta": {
      "rank": 24,
      "category": "Fiction",
      "publisher": "DeepNerd Media",
      "description": "In the mountains of central Appalachia, blood runs as deep as these hollers and just as dark. Since before our kind knew these hills, hearts of unknowable hunger and madness have slumbered beneath them. These are the darkest mountains in the world. How dare we think we can break the skin of a god and dig out its heart without bringing forth blood and darkness? Old Gods of Appalachia is a horror-anthology podcast set in the shadows of an Alternate Appalachia, a place where digging too deep into the mines was just the first mistake.To learn more about Old Gods of Appalachia, visit our website at www.oldgodsofappalachia.com, and be sure to complete your social media ritual and follow us on Facebook and Instagram @oldgodsofappalachia, or Twitter and Tumblr @oldgodspod. If you'd like to support the show, you can join or Patreon at www.patreon.com/oldgodsofappalachia, or support us on Acast at supporter.acast.com/old-gods-of-appalachia. You can also find t-shirts, hoodies, mugs, and other Old Gods merch in our shop at www.teepublic.com/stores/oldgodsofappalachia.Old Gods of Appalachia is a production of DeepNerd Media and is distributed by Rusty Quill. All rights reserved. Get Build Mama a Coffin, Black Mouthed Dog and other exclusive content on Patreon!Support this show http://supporter.acast.com/old-gods-of-appalachia. Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1fb155da07f18cc55a0f072472",
      "appleId": "id1485435369",
      "ratings": 3606,
      "velocity": 0
    }
  },
  {
    "title": "CreepsMcPasta Creepypasta Radio",
    "link": "7l0iRPdyi5UcHtDVWStxl4",
    "meta": {
      "rank": 25,
      "category": "Fiction",
      "publisher": "Creeps McPasta",
      "description": "'Creepypastas' are the urban legends of the internet. A new age of horror told through digital word of mouth.",
      "image": "https://i.scdn.co/image/13440e20be74aaccc6b92337a6067c07c708f6d5",
      "appleId": "id1492008134",
      "ratings": 1739,
      "velocity": 0
    }
  },
  {
    "title": "The Two Princes",
    "link": "70QlYnLX3izDdFhlKfOaeF",
    "meta": {
      "rank": 26,
      "category": "Fiction",
      "publisher": "Gimlet",
      "description": "Rupert and Amir are finally getting married and this time nothing is going to stop them. Not the handsome new prince who’s rolled into town and only has eyes for Rupert. Not the mysterious disappearance of half the kingdom’s population. Not even the End of the World. Yes, this time the princes are definitely, absolutely, 100% getting married – even if it’s the last thing they do. Season 3 is out now!The Two Princes stars Noah Galvin, Ari'el Stachel, Jonah Fields, Gideon Glick, Michelle Gomez, Mandi Masden, Wesley Taylor, Samira Wiley, and CJ Wilson. The Two Princes was written by Kevin Christopher Snipes and directed by Mimi O’Donnell. Music and lyrics by Matt Schatz.Executive producer Mimi O'Donnell, senior producer Katie Pastore, associate producer Julie Balefsky. Recorded and mixed by Jonathon Roberts, engineered by Armando Serrano, sound design by Daniel Brunelle. Music direction by Jonathon Roberts. Score by Greg Laswell.",
      "image": "https://i.scdn.co/image/ab67656300005f1f078fe01b72f22189840beb73",
      "velocity": 0
    }
  },
  {
    "title": "We're Alive",
    "link": "72cVljR6gfw5yiVUDMo6g3",
    "meta": {
      "rank": 27,
      "category": "Fiction",
      "publisher": "Wayland Productions Inc",
      "description": "Listen to the entire epic series, which follows Survivors in Los Angeles after the world has been turned upside down. It begins with “A Story of Survival” which spans from Chapters 1-48. Our survivors band together, fortify a safe haven known as the Tower, and discover that the Infected are far from the biggest threat they will have to face.The adventure continues with two mini-series:“Lockdown” - A small group of inmates and prison guards are trapped in the T-block at Twin Towers Jail. They are forced to work together and find a way to escape while the rest of the world ends around them.“Goldrush” - Set 17 years after the main events of “A Story of Survival”, this is a recollection story that describes the efforts of the four Soldiers as they attempt a side mission to retrieve a suspected stash of gold bullion.Our newest season is “We’re Alive: Descendants”:The story of survival continues; the fight is not over.18 years after the Outbreak, the world is starting to re-organize and rebuild, but many different forms of humanity are still struggling to survive in the aftermath. Nicholas Tink grew up in the shadow of his father- the late, great, Saul Tink. Little does he know that deep in the places where infected dwell, another descendant lies waiting.  Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa7de534fd97f0bf3225ed0c2",
      "appleId": "id313300476",
      "ratings": 8954,
      "velocity": 0
    }
  },
  {
    "title": "Faerie",
    "link": "2luefy24L2m5FOxSZ4eiFi",
    "meta": {
      "rank": 28,
      "category": "Fiction",
      "publisher": "Parcast",
      "description": "Welcome to a world where fairy tales do exist, and “once upon a time” is closer, darker, and more dangerous than you imagined. Welcome to the immersive new Parcast original series, Faerie. Available exclusively on Spotify, Faerie follows the investigation of Ryan Bailey—a young woman, who by happenstance, saves a man’s life and is thrust into a secret world of mythological creatures called “faeries.” Join Ryan as she unearths more about their mysterious existence and the covert agency charged with protecting them. This 12-episode event is brought to you in partnership with Public Radio Alliance. Faerie is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1fed8b492bb1be9973268677eb",
      "velocity": 0
    }
  },
  {
    "title": "The NoSleep Podcast",
    "link": "5XhS5WBxLYgN3S9KhEyrrF",
    "meta": {
      "rank": 29,
      "category": "Fiction",
      "publisher": "David Cummings",
      "description": "The NoSleep Podcast is a multi-award winning anthology series of original horror stories, with rich atmospheric music to enhance the frightening tales.",
      "image": "https://i.scdn.co/image/ab67656300005f1fdcf7fe0ff5151cb8c9a0ebe5",
      "appleId": "id444083093",
      "ratings": 11942,
      "velocity": 0
    }
  },
  {
    "title": "Paranormal",
    "link": "6uiXpyl749yOE2vs8sCrdW",
    "meta": {
      "rank": 30,
      "category": "Fiction",
      "publisher": "Fepo",
      "description": "Canal de investigación y difusión de fenómenos no humanos (OVNI extraterrestre), duendes, fantasmas, clarividencia, médiums, brujería y demás anomalías paranormales que suceden dentro y fuera de nuestro planeta. Creado y conducido por: @fepomx",
      "image": "https://i.scdn.co/image/ab67656300005f1f3f4a6b04044a5bfd4f62cdff",
      "appleId": "id78459818",
      "ratings": 4279,
      "velocity": 0
    }
  },
  {
    "title": "Definitely Holy Audios :)",
    "link": "2WFtFf4FXpeSeFXBfh7ULB",
    "meta": {
      "rank": 31,
      "category": "Fiction",
      "publisher": "Normal man :)",
      "description": "Discord: https://discord.gg/6u32UpHY   Since there’s only character X female listeners (I think) I said “fine, I’ll do it myself” and here I am. My Spotify account is “ Just a normal man here “ and yeah that’s my name. Anyways enjoy these male listener audios and maybe some NB audios :)",
      "image": "https://i.scdn.co/image/ab67656300005f1f9402377c473766e9f50a91f5",
      "velocity": 0
    }
  },
  {
    "title": "☆´･𝐌𝐚𝐠𝐢𝐱_ 𝐀𝐮𝐝𝐢𝐨𝐬!･`☆",
    "link": "1EDqxjVqMg2TYlzRktA0Gu",
    "meta": {
      "rank": 32,
      "category": "Fiction",
      "publisher": "𝐌𝐚𝐠𝐢𝐱_ ",
      "description": "︶꒦꒷♡꒷꒦︶ ʜᴇʟʟᴏ! ᴍʏ ɴᴀᴍᴇꜱ ᴍᴀɢɪx ᴀɴᴅ ɪ ᴜᴘʟᴏᴀᴅ ᴀꜱᴍʀ ᴀᴜᴅɪᴏꜱ ꜰᴏʀ ʏᴏᴜ ᴛᴏ ᴇɴᴊᴏʏ! ʜᴇʏ ɪᴍ ꜱᴏʀʀʏ ɪᴍ ɴᴏᴛ ᴄᴏᴍꜰᴏʀᴛᴀʙʟᴇ ᴅᴏɪɴɢ ʏᴀɴᴅᴇʀᴇ/ ɴꜱꜰᴡ ᴀᴜᴅɪᴏꜱ —————  https://open.spotify.com/user/14iefh972n2rboumqx25ov0y1?si=0VPwMdkWR8-CTDvb6BUWaA&utm_source=copy-link  ————— https://discord.gg/cH34Zzezda  ————— ɪɴꜱᴛᴀɢʀᴀᴍ https://www.instagram.com/Magix___/ —————",
      "image": "https://i.scdn.co/image/ab67656300005f1f3bed53e25952ad4eaa2bec82",
      "velocity": 0
    }
  },
  {
    "title": "Mayfair Watchers Society",
    "link": "4cF39z0TJByoJ9cKGWeUk6",
    "meta": {
      "rank": 33,
      "category": "Fiction",
      "publisher": "Bloody FM",
      "description": "Trevor Henderson's creatures come to life in \"Mayfair Watcher's Society.\"The town of Mayfair is just like any other: tidy lawns and book clubs, bake sales and Sunday school. And just like any other town, Mayfair has a secret - one that everyone knows, but almost no one says: Along the bus routes and down silent wooded roads, behind the mill and at the dark end of parking lots, at the edge of the porch, just beyond the lamp light, things move in the shadows. But, Mayfair is a town like any other: and a secret like this can only stay hidden for so long.A Bloody FM original. Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa350749099dbcff780f6b991",
      "appleId": "id1646154626",
      "ratings": 198,
      "velocity": 0
    }
  },
  {
    "title": "The Dark Somnium",
    "link": "2mh1jd7nq8BMzl2kjGGBCV",
    "meta": {
      "rank": 34,
      "category": "Fiction",
      "publisher": "The Dark Somnium",
      "description": "Welcome to The Dark Somnium. Scary Story, Creepypasta and Nosleep narrations with Original music and sound design.",
      "image": "https://i.scdn.co/image/ab67656300005f1ffe0e8dda74a186e21c3cad2d",
      "appleId": "id1546000046",
      "ratings": 705,
      "velocity": 0
    }
  },
  {
    "title": "Blackout",
    "link": "5DoBLLrqyjhXSI0AP25M7z",
    "meta": {
      "rank": 35,
      "category": "Fiction",
      "publisher": "QCODE & Endeavor Content",
      "description": "Academy Award® winner Rami Malek stars in this apocalyptic thriller as a small-town radio DJ fighting to protect his family and community after the power grid goes down nationwide, upending modern civilization. Season 2 picks up after Simon’s family escapes. Upon crossing paths with an old family friend, Wren (played by Aja Naomi King), recounts her experience getting out of Boston... but can she be trusted? What truths remain to be uncovered about the origins of this blackout? Produced by QCODE and Endeavor Content. Created by Scott Conroy. Season 1 stars and is executive produced by Rami Malek. Written by Scott Conroy. Directed by Shawn Christensen.  Season 2 stars Rami Malek and Aja Naomi King. Written by Jeremy Novick. Directed by Stefanie Abel Horowitz and Jeremy Novick. BLACKOUT is presented by Sonos. Discover sound made easy at Sonos.com.",
      "image": "https://i.scdn.co/image/ab67656300005f1f229005ff77dddf5bee9a6740",
      "appleId": "id1447513097",
      "ratings": 26783,
      "velocity": 0
    }
  },
  {
    "title": "GUNDOG",
    "link": "5XZF4WXGdNPjinXlrm1GdU",
    "meta": {
      "rank": 36,
      "category": "Fiction",
      "publisher": "Gary Whitta | Realm",
      "description": "From the writer of The Book of Eli and co-writer of Rogue One: A Star Wars Story comes an all-new sci-fi epic performed by Shannon Woodward (Westworld, The Last of Us Part II). In the near future, Earth has been conquered by a race of brutal alien machines known as the Mek. When a young woman stumbles across a mysterious map that may hold the secret to humanity’s liberation, she embarks on a dangerous odyssey that leads her to an amazing discovery — a long-lost prototype war machine known as a Gundog. Now she must confront a legacy she never knew she had to face down an overwhelmingly superior enemy in the hope of sparking a new flame of human resistance...",
      "image": "https://i.scdn.co/image/ab67656300005f1f60762c75f708e5b73ce9f3d3",
      "appleId": "id1631586716",
      "ratings": 304,
      "velocity": 0
    }
  },
  {
    "title": "Connor Pugs ",
    "link": "22BnYI5VssrkSKbEqV7X1j",
    "meta": {
      "rank": 37,
      "category": "Fiction",
      "publisher": "Connor Pugs",
      "description": "Here are all the storytime videos from Connor Pugs. Connor Pugs makes stories on a variety of topics, and his main inspirations for storytime videos are scrubby aka scrubs and Luna.  Support this podcast: https://anchor.fm/connor-pugs/support",
      "image": "https://i.scdn.co/image/ab67656300005f1f1753fa10d011d82558809cd0",
      "appleId": "id1640310598",
      "ratings": 106,
      "velocity": 0
    }
  },
  {
    "title": "Six Minutes",
    "link": "4tL2Nyn5iEkAM9DUglm5OW",
    "meta": {
      "rank": 38,
      "category": "Fiction",
      "publisher": "Gen-Z Media | Wondery",
      "description": "Eleven-year-old Holiday is pulled from the icy waters of Alaska with no memory of who she is or where she came from. Are her mom and dad really who they say they are? And when she begins to develop incredible abilities, she’ll soon discover she’s not alone in the world.From the Peabody award-winning creators of The Unexplainable Disappearance of Mars Patel and the Peabody award-nominated Treasure Island 2020 comes Six Minutes, a mystery adventure for the whole family. Six minute episodes, twice a week, all year long…and beyond.Produced by Gen-Z Media. For more great Gen-Z shows visit http://gzmshows.com  ",
      "image": "https://i.scdn.co/image/ab67656300005f1fec1a17e623b1eeef7d834d20",
      "appleId": "id1348470106",
      "ratings": 13214,
      "velocity": 0
    }
  },
  {
    "title": "October's Children",
    "link": "0LqM1EmKENYh7rtzfcjukT",
    "meta": {
      "rank": 39,
      "category": "Fiction",
      "publisher": "ArcanaCast",
      "description": "\"October’s Children\" is an episodic full-cast paranormal mystery/action horror audio drama set in a small college town in New England.   \"October’s Children\" focuses on a small, diverse group of 20- and 30-somethings trying to survive the trials and tribulations of ‘everyday’ life in Wolfbrook, New Hampshire. Unbeknownst to them at series start, the group will face increasingly strange and dangerous situations as the boundaries between our world and another fade, and monstrous creatures begin to infiltrate and invade Wolfbrook.",
      "image": "https://i.scdn.co/image/ab67656300005f1f5db5896492e6516dc751a4cf",
      "appleId": "id1637992763",
      "ratings": 39,
      "velocity": 0
    }
  },
  {
    "title": "The SCP Experience",
    "link": "3ELCNltCdM1QDCjlS9WZ6T",
    "meta": {
      "rank": 40,
      "category": "Fiction",
      "publisher": "Dr. NoSleep",
      "description": "Original SCP encounters derived from the SCP Foundation database. New episodes are released weekly. Be sure to click follow or subscribe to receive all notifications. 🔔  Advertising Inquiries: This podcast is represented by True Native Media. Email all advertising inquiries to info@truenativemedia.com.  Business Inquiries: business@drnosleep.com  * * *  EXPLICIT CONTENT DISCLAIMER: This podcast contains explicit content and is intended for adults 18 years of age or older. These stories are NOT intended for children under the age of 18. Parental guidance is strongly advised for children under the age of 18. Listener discretion is advised.  COPYRIGHT WARNING:  The use of any affiliated audio of these episodes is not allowed, as it is a direct violation of copyright law and will result in legal action.  LEGAL DISCLAIMER:  Content related to the SCP Foundation, including this podcast, are licensed under Creative Commons Sharealike 3.0 Concepts.    Copyright © 2023 The SCP Experience   #thescpexperience #scp #scpfoundation #scpencounters #securecontainprotect #scpstories #scpexplained #whatisscp",
      "image": "https://i.scdn.co/image/ab67656300005f1f094c1b59121bedaf216629e9",
      "appleId": "id1562460039",
      "ratings": 351,
      "velocity": 0
    }
  },
  {
    "title": "Strawberry Spring",
    "link": "0goz2PRCT0qogGeShK9T3k",
    "meta": {
      "rank": 41,
      "category": "Fiction",
      "publisher": "iHeartPodcasts and Audio Up, Inc.",
      "description": "Based on the short story by Stephen King, Strawberry Spring is a scripted podcast set against the backdrop of the sixties revolution on the campus of New Sharon College. We follow a generation of students who don't trust authority, the futile efforts of the local police, and a young, determined reporter as he chases the bloody trail of Springheel Jack, an unrelenting, modern-day Jack the Ripper. After vanishing and leaving his murders unsolved, Jack is back - along with a new Strawberry Spring, a weather pattern with an unusual fog bank that rolls in every eight years. Using the fog to hide his tracks, he taunts New Sharon with fresh kills, each murder more violent than the last. The 8-episode season stars Garrett Hedlund, Milo Ventimiglia, Sydney Sweeney, Herizen Guardiola, Al Madrigal, Ken Marino, and Brec Bassinger.",
      "image": "https://i.scdn.co/image/ab67656300005f1f35144b3e53e4a20a5e015448",
      "appleId": "id1582491051",
      "ratings": 1347,
      "velocity": 0
    }
  },
  {
    "title": "Afflicted: A Horror Thriller Audio Drama",
    "link": "3e3kdEdlJC6QlurgOVH2aJ",
    "meta": {
      "rank": 42,
      "category": "Fiction",
      "publisher": "Ransom Media Productions",
      "description": "Lovecraft Country meets True Blood in this new series from award-winning producers Tonia Ransom and Jen Zink. In this season, a small East Texas town suffers supernatural disasters caused by a demonic book bound in human flesh...and only hoodoo can save the town from its affliction. Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f84bbf047cc17620a4369bd96",
      "appleId": "id1648705536",
      "ratings": 66,
      "velocity": 0
    }
  },
  {
    "title": "Last Known Position",
    "link": "0f2CJAANySsEuAqbaeLtnK",
    "meta": {
      "rank": 43,
      "category": "Fiction",
      "publisher": "QCODE",
      "description": "A new mystery thriller from the makers of Blackout and The Left Right Game, Last Known Position follows a group of experts including submersible pilot Mikaela Soto (Gina Rodriguez) as they seek to recover a flight that suddenly vanished over the Pacific Ocean.  The super yacht sets off on what looks like an expedition funded by a grieving billionaire, William Cavanaugh (James Purefoy), to recover the flight that his wife and daughter were on. But the crew soon discovers that there's more to the expedition than they were let on when they start to find themselves in increasingly perilous situations that point to a saboteur among the group, and a looming threat in the deep waters. Last Known Position premieres everywhere on Monday, December 20th. QCODE+ subscribers on Apple Podcasts will get early access to new episodes before anyone else and exclusive bonus content. Learn more at apple.co/qcode. Produced by QCODE. Created and written by Lucas Passmore and directed by John Wynn. Starring Gina Rodriguez and James Purefoy. ",
      "image": "https://i.scdn.co/image/ab67656300005f1fff336630316a734d82f5e2e4",
      "appleId": "id1598657214",
      "ratings": 1726,
      "velocity": 0
    }
  },
  {
    "title": "Redwood Bureau",
    "link": "5OgfQg3svBwSUiU0zGqhet",
    "meta": {
      "rank": 44,
      "category": "Fiction",
      "publisher": "Eeriecast Network",
      "description": "Josh Tomar is Agent Conroy, a former operative on the run from a dangerous, secret organization called Redwood Bureau. The Bureau researches and captures supernatural entities usually at the cost of human lives, and Agent Conroy is here to leak their reports to the public. New episodes every other Tuesday.",
      "image": "https://i.scdn.co/image/ab67656300005f1f1783510ff4ecfa03a00db1e0",
      "appleId": "id1597996941",
      "ratings": 451,
      "velocity": 0
    }
  },
  {
    "title": "Malevolent",
    "link": "7Dd5CTKuEN9AAFkYzjbsvK",
    "meta": {
      "rank": 45,
      "category": "Fiction",
      "publisher": "Harlan Guthrie",
      "description": "Do not fear the dark, fear what darkness brings... Arkham Private Investigator Arthur Lester wakes up with no memory of who he is or what has happened, only a nameless, eerie voice guiding him through the darkness.Blind, terrified, and confused, his journey will lead him towards a series of mysteries in the hopes of understanding the truth of what has transpired.As cosmic horrors seep into the world around, Arthur must ask himself whether this entity truly seeks to help him, or are its intentions more…MalevolentMalevolent is produced, written, edited, performed, scored & created by Harlan Guthrie. This podcast contains mature themes, explicit language, bodily horror, violence, otherworldly terror and death. Listener discretion is advised. Full transcripts of every episode are available here.  Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f07a06522757bd8b41ab5a4f1",
      "appleId": "id1525652021",
      "ratings": 523,
      "velocity": 0
    }
  },
  {
    "title": "Tower 4",
    "link": "4YChJfyufByaRzekQVKNGG",
    "meta": {
      "rank": 46,
      "category": "Fiction",
      "publisher": "Bloody FM",
      "description": "Mike Archer is a newly appointed fire watcher in the Wyoming woods. While he's never done anything like this before, he needed something new after his mom passed. Now he hopes to spend his days in a tower above the trees looking for fires and working on his new book. But things aren't as quiet and peaceful as he hoped. Strange interference blasts over his radio at night and he starts seeing and hearing creepy noises in the woods. But are these odd occurrences actually happening or is he just going stir crazy? Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1ffb74fc1afd512b06f72e2af0",
      "appleId": "id1533736348",
      "ratings": 1464,
      "velocity": 0
    }
  },
  {
    "title": "Batman: Stained Heir",
    "link": "58tRC6KNX0qankd5kwQTjv",
    "meta": {
      "rank": 47,
      "category": "Fiction",
      "publisher": "Jason",
      "description": "Batman: Stained Heir is a non-profit fan-made audio drama written by Jason Ortega based on the characters created by Bob Kane and Bill Finger. The story follows Batman as he tackles The Executioner and faces a crumbling relationship with Jason Todd following his run as The Red Hood. Stained Heir has no affiliation with Bob Kane, Bill Finger, or DC Comics.",
      "image": "https://i.scdn.co/image/ab67656300005f1f48f0443d23b1b1d7b1ba61fe",
      "appleId": "id1639182862",
      "ratings": 6,
      "velocity": 0
    }
  },
  {
    "title": "NSFW Genshin Asmr ",
    "link": "3jSvnsYNfqqhW7CzOOzEys",
    "meta": {
      "rank": 48,
      "category": "Fiction",
      "publisher": "Yuno",
      "description": "Here I'm just gonna post some NSFW audios for you horny people to enjoy 🧘🏻‍♀️  https://open.spotify.com/user/6jlwf4zb7emw20j7y7nkk0606?si=MK6-xJ-LTjy_p3i_AjnuYA  Europe server UID: 755174685 if anyone wants to be friends or buy me primos 😔",
      "image": "https://i.scdn.co/image/ab67656300005f1f6786fb1d19a67a3c2889e628",
      "velocity": 0
    }
  },
  {
    "title": "Mythical Monsters ",
    "link": "5viQDUDBZ4tsPFlAwnn1v0",
    "meta": {
      "rank": 49,
      "category": "Fiction",
      "publisher": "Parcast",
      "description": "Travel the world in search of the strangest and most powerful creatures from myth and legend. These beasts are alternately beautiful and ferocious, seductive and sadistic. But no matter what form they take, they tell a story about their culture as only a monster can. Mythical Monsters is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1f33d793132a990df98e4f072b",
      "appleId": "id1605501224",
      "ratings": 4,
      "velocity": 0
    }
  },
  {
    "title": "Quiet Part Loud",
    "link": "2HDYHI2RKjeJxL21636Opg",
    "meta": {
      "rank": 50,
      "category": "Fiction",
      "publisher": "Gimlet",
      "description": "Disgraced radio host Rick Egan (Tracy Letts) has finally found his chance at reinventing himself: by chronicling the cold-case disappearance of several Muslim teens from Staten Island—a group he himself disparaged—in the wake of 9/11. But Rick soon discovers this is no ordinary hate crime, as his ill-considered investigations bring him face-to-face with an ancient American evil that's ready to offer him a monstrous bargain.Quiet Part Loud, created by Monkeypaw Productions, written by Mac Rogers and Clay McLeod Chapman. Directed by Mimi O’Donnell. Executive produced by Jordan Peele, Win Rosenfeld, and Mimi O’Donnell. Produced by Geoff Foster, Amy McLeish, and Katie Pastore. Associate produced by Jasmyne Peck-Bailey, Julie Balefsky, and Kayla Stokes. Supervising Sound Editor Jonathon Roberts. Sound Design by Marcus Bagala, Daniel Brunelle, Shane Hendrickson, and Jonathon Roberts. Score by Roahn Hylton and Jacob Yoffee. Recording by Jonathon Roberts and Armando Serrano. Dialogue editing by Steven Tejeda and Gordon Bramli. Mix and additional sound design by Bobby Lord.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd2d6d205ea96bf3fdfbf5527",
      "velocity": 0
    }
  }
]