[
  {
    "title": "That Chapter Podcast",
    "link": "5LPqLzjZutoof7avsALbYK",
    "meta": {
      "rank": 1,
      "category": "True Crime",
      "publisher": "That Chapter",
      "description": "That Chapter Podcast is your home for the craziest true crime cases, weirdest plots, and strangest horrors from around the world, from back in the day to today. That Chapter Podcast has it all, telling you the scariest stories with a little laugh or two along the way.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4dc0c42f75f0bd5c3b071f1e",
      "followers": 34900,
      "appleId": "id1663948238",
      "ratings": 2500
    }
  },
  {
    "title": "Stolen Hearts",
    "link": "5XO49eDYSak9tsnrrWzRGr",
    "meta": {
      "rank": 2,
      "category": "True Crime",
      "publisher": "Wondery",
      "description": "Sergeant Jill Evans is a small town cop in Wales with an impressive record in her job, and a less than impressive record in her love life. After three engagements, two divorces and one affair, she’s beginning to worry that love is only true in fairy tales. That is until she meets: Dean. He’s a wealthy beauty entrepreneur with his own range of toiletries.Girl meets boy. Boy meets girl. They kiss and fall in love. Roll credits.But that would be boring, wouldn’t it? Instead, this is a love story like no other. It’s all going so well for Jill and Dean, until Halloween night, when Dean disappears. And Sgt. Jill is left to pick up the pieces.From Wondery and Novel, comes a new series. Hosted by Kerry Godliman.Follow Stolen Hearts on Amazon Music or wherever you get your podcasts. You can listen early and ad-free by subscribing to Wondery+ in Apple Podcasts or the Wondery App. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f1db2f9d89bf64ccf8e87cc19"
    }
  },
  {
    "title": "Crime Junkie",
    "link": "3DgfoleqaW61T2amZQKINx",
    "meta": {
      "rank": 3,
      "category": "True Crime",
      "publisher": "audiochuck",
      "description": "If you can never get enough true crime... Congratulations, you’ve found your people.",
      "image": "https://i.scdn.co/image/ab67656300005f1ff4ee04946306cf39d230a073",
      "followers": 139711,
      "appleId": "id1322200189",
      "ratings": 331171
    }
  },
  {
    "title": "Deep Cover: Never Seen Again",
    "link": "6FJkQKT7bl2RvjMZUyDceF",
    "meta": {
      "rank": 4,
      "category": "True Crime",
      "publisher": "Pushkin Industries",
      "description": "Deep Cover is a show about people who lead double lives. Pulitzer Prize-winning journalist Jake Halpern reveals webs of deception and dark underworlds, through interviews with federal agents and convicted criminals.  Season three, Never Seen Again, tells the story of two women, living on opposite sides of the country, who went missing in the summer of 1999.  Seven years later, their stories collided when a small town detective got a tip and became convinced that if he could solve one mystery, he'd solve the other.  Season two, Mob Land, is about a high-rolling lawyer who joins forces with the feds to try to bring down one of the most powerful criminal syndicates in the country.  Season one, The Drug Wars, tells the story of an FBI agent who goes undercover with a biker gang, and follows a trail of clues that eventually leads to the US invasion of a foreign country. Deep Cover drops on Mondays. To hear all of season 3 early, ad-free, subscribe to Pushkin+ in Apple Podcasts or at pushkin.fm/plus. iHeartMedia is the exclusive podcast partner of Pushkin Industries. ",
      "image": "https://i.scdn.co/image/ab67656300005f1fef577fbd8cd643734ee9ae47",
      "followers": 12807,
      "appleId": "id1520478402",
      "ratings": 2955
    }
  },
  {
    "title": "Murder, Mystery & Makeup",
    "link": "615iXBRDJi3MVoO4cC7Fmq",
    "meta": {
      "rank": 5,
      "category": "True Crime",
      "publisher": "Audioboom Studios",
      "description": "Bailey Sarian, a professional makeup artist and true crime aficionado, is now bringing episodes of her YouTube series “Murder, Mystery & Makeup” to podcast! Covering anything from cannibals to cover-ups. Join us on this journey. It’ll be fun, we promise. Idk. lol.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4a89f95450f843868eac550f",
      "appleId": "id1591653048",
      "ratings": 5243
    }
  },
  {
    "title": "Serial Killers",
    "link": "4ruq7mH0jg1sFi8KQhnGb8",
    "meta": {
      "rank": 6,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "Get a rare glimpse into the minds and methods of sadistic murderers. From notorious names like Jeffrey Dahmer and John Wayne Gacy to lesser-known killers like “Death House Landlady” Dorothea Puente, what turns a regular person into a predator? Serial Killers is a Spotify Original from Parcast. New episodes Mondays and Thursdays.",
      "image": "https://i.scdn.co/image/ab67656300005f1f17ead1974c7c7f79e5b769ba"
    }
  },
  {
    "title": "Dateline NBC",
    "link": "3MGn724Y6BOSQzfmk3TyuY",
    "meta": {
      "rank": 7,
      "category": "True Crime",
      "publisher": "NBC News",
      "description": "Current and classic episodes, featuring compelling true-crime mysteries, powerful documentaries and in-depth investigations.",
      "image": "https://i.scdn.co/image/fcf81e5573fba089237c3d1f2b885493edb867af",
      "followers": 50867,
      "appleId": "id1464919521",
      "ratings": 30436
    }
  },
  {
    "title": "Murdaugh Murders Podcast",
    "link": "0zqV1HebaiK4GUP7tK7YBN",
    "meta": {
      "rank": 8,
      "category": "True Crime",
      "publisher": "Luna Shark",
      "description": "For nearly 100 years, one family traded influence and held power in the South Carolina lowcountry until a fatal boat crash involving an allegedly intoxicated heir-apparent shed sunlight on a true crime saga like no other.  Award-winning journalist Mandy Matney has been investigating the Murdaugh family since that fateful night in 2019. The now-infamous Murdaugh family is at the center of a litany of criminal investigations into fraud, obstruction of justice, the 2021 double homicides of Paul Murdaugh and his mother Maggie, the 2015 murder of young Stephen Smith, the suicide-for-hire plot of family patriarch Alex Murdaugh (who has since been charged with Paul & Maggie’s murders) and a vast insurance scheme that preyed on the region's most vulnerable citizens. Matney's podcast, ranked #1 globally in 2021, provides unmatched insight into the horrific deaths, botched investigations and newly-uncovered crimes that are all interconnected.  Every corner of the justice system seems to be connected to this vile web of deceit, murder and corruption. Now featuring Co-host Liz Farrell, you’ll follow along in real time from South Carolina as their exclusive sources guide listeners on a journey to expose the truth wherever it leads. Listen on any streaming service or visit murdaughmurderspodcast.com to learn more.   Find us on social media: https://www.facebook.com/MurdaughPod/ https://www.instagram.com/murdaughmurderspod/   For current & accurate updates: Twitter.com/mandymatney  Support Our Mission: murdaughmurderspodcast.com/support-the-show",
      "image": "https://i.scdn.co/image/ab67656300005f1fc756dffada0c50105b0cb004",
      "appleId": "id1573560247",
      "ratings": 27972
    }
  },
  {
    "title": "Frozen Head",
    "link": "7DKMVRPZxsLT9Ke0xZMCk7",
    "meta": {
      "rank": 9,
      "category": "True Crime",
      "publisher": "Wondery",
      "description": "Hosted by Ash Kelley and Alaina Urquhart from the hit show Morbid.When 90-year-old Laurence Pilgeram drops dead on the sidewalk outside his condo, you might think that’s the end of his story. But, really, it’s just the beginning. Because Laurence and others like him have signed up to be frozen and brought back to life in the future. And that belief will pull multiple generations of the Pilgeram family into a cryonics soap opera filled with dead pets, gold coins, grenades, fist fights, mysterious packages, family feuds, Hall of Fame baseball legends, and frozen heads — lots of frozen heads. From Wondery, comes a story about life, death, and what comes next.Follow Frozen Head on Amazon Music or wherever you get your podcasts. Binge early and ad-free by subscribing to Wondery+ in Apple Podcasts or the Wondery App. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f7fbc2af1140d62a15a29db96",
      "appleId": "id1656128059",
      "ratings": 445
    }
  },
  {
    "title": "Strangeland",
    "link": "6E8K39JSSVCSqQJD2LV1U6",
    "meta": {
      "rank": 10,
      "category": "True Crime",
      "publisher": "audiochuck | Western Sound",
      "description": "STRANGELAND from audiochuck is an investigative series that examines cases in immigrant neighborhoods.  Season 2: Murder is Maple Shade is hosted by investigative journalist Ben Adair and award-winning journalist with more than 30 years experience across three continents, Tinku Ray.  Maple Shade, New Jersey is a quaint suburb where the motto is, “Nice Town, Friendly People.” But on the evening of March 23, 2017, an Indian tech worker, Sasikala Narra, and her six-year-old son, Anish, were found brutally murdered in their apartment. Police questioned the husband and father, Hanumantha, but his alibi checked out. Six years later, the case is still unsolved, and authorities won’t discuss it. So, we’re investigating for ourselves and discovering new leads, potential motives, and questionable behavior by local authorities. Will there ever be justice for Sasikala and Anish?  Strangeland is produced by Western Sound.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0c04224269e39c69587a526a",
      "appleId": "id1590577089",
      "ratings": 1360
    }
  },
  {
    "title": "True Crime with Kendall Rae",
    "link": "4d6RwH9XKnZ6osfNVc26eJ",
    "meta": {
      "rank": 11,
      "category": "True Crime",
      "publisher": "Mile Higher Media & Audioboom Studios",
      "description": "Kendall Rae is a true-crime content creator on YouTube who has used her platform to spread awareness for victims and their families. Now she is bringing episodes of her YouTube true-crime series to podcast format, to hopefully create even more awareness around the cases she covers. Kendall's approach to true-crime content is empathetic and always approached with victims in mind first. Join Kendall in her journey to spread awareness and bring justice to those who need it most!",
      "image": "https://i.scdn.co/image/ab67656300005f1ffff7a0a1d94c6b0d4f3c9c0c",
      "appleId": "id1618050230",
      "ratings": 2385
    }
  },
  {
    "title": "Rotten Mango",
    "link": "2DZwvzn6Z3xCFZrwZGDrbj",
    "meta": {
      "rank": 12,
      "category": "True Crime",
      "publisher": "Stephanie Soo & Ramble",
      "description": "Rotten but still a little sweet! Rotten Mango is a true crime + all things spooky podcast. We love doing deep dives into the darkest crimes and we tend to not leave out any details - which can get a little rotten at times. If you want deep dives in the psychology of killers, no holding back storytelling of crimes, and stories of lesser known criminals from around the world this is the place for you. Welcome to Rotten Mango but don’t worry it all comes with a seasoning of comedy/sweetness.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4e7e0a2a3657f84cb8dde756",
      "appleId": "id1517954480",
      "ratings": 17794
    }
  },
  {
    "title": "Unsolved Murders: True Crime Stories",
    "link": "6Mk7Wk6cmrgXWnitO3NdYe",
    "meta": {
      "rank": 13,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "Unsolved Murders: True Crime Stories is a podcast drama with a modern twist on old time radio that delves into the mystery of true cold cases and unsolved murders. With the help of an ensemble cast, follow our hosts as they take you on an entertaining journey through the crime scene, the investigation and attempt to solve the case. With many surprising plot twists, it’s important you start listening from the first episode of a cold case. New episodes are released every Tuesday. Unsolved Murders: True Crime Stories is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1f81fad7437bae287da569b9d9"
    }
  },
  {
    "title": "Last Podcast On The Left",
    "link": "3yZg2MCkf31pPXiG4nznrg",
    "meta": {
      "rank": 14,
      "category": "True Crime",
      "publisher": "The Last Podcast Network",
      "description": "The Last Podcast On The Left covers all the horrors our world has to offer both imagined and real, from demons and slashers to cults and serial killers, The Last Podcast is guaranteed to satisfy your blood lust.",
      "image": "https://i.scdn.co/image/ab67656300005f1fe37212330575352589fc5430",
      "followers": 151803,
      "appleId": "id437299706",
      "ratings": 46931
    }
  },
  {
    "title": "Cup of Justice",
    "link": "3Itp67SQTZEHQGgrX0TYTl",
    "meta": {
      "rank": 15,
      "category": "True Crime",
      "publisher": "Luna Shark",
      "description": "We all want to drink from the same Cup of Justice... and it starts with learning about our legal system. With tales from the newsroom and the courtroom, Mandy Matney, Liz Farrell and Eric Bland invite you to gain knowledge, insight, and tools to hold public agencies and officials accountable.  Beginning as bonus episodes to the Murdaugh Murders Podcast with analysis of the trials of Alex Murdaugh and co-conspirators, Cup of Justice launched as its own show in January of 2023. Mandy Matney, Liz Farrell from the Murdaugh Murders Podcast and everyone’s favorite attorney Eric Bland take a hard look at everything from the state of news to important cases around the world. INVESTIGATIVE JOURNALISM Mandy and Liz are two of the most driven and talented investigative journalists who are revolutionizing how news is derived and delivered. Join them as they pull at threads and chase down leads to get the story straight. THE LAW With the expertise of Eric Bland, we empower listeners to understand their legal system in an entertaining format while providing tools to hold agencies and public figures accountable in order to give voice to victims and change those systems for the better. JUSTICE SYSTEMS We know that our justice systems are intimidating, but we will all encounter it at one point. Together, our hosts create the perfect trifecta of legal expertise, journalistic integrity and a fire lit to expose the truth wherever it leads.   Learn more about our hosts and mission at CupofJusticePod.com Support Our Podcast at: https://murdaughmurderspodcast.com/support-the-show Please consider sharing your support by leaving a review on Apple at the following link:   *The views expressed on the Cup of Justice bonus episodes do not constitute legal advice. Listeners desiring legal advice for any particular legal matter are urged to consult an attorney of their choosing who can provide legal advice based upon a full understanding of the facts and circumstances of their claim. The views expressed on the Cup of Justice episodes also do not express the views or opinions of Bland Richter, LLP, or its attorneys.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9354e289ff6a4ee0dbaf1fbb",
      "appleId": "id1668668400",
      "ratings": 1482
    }
  },
  {
    "title": "Murder With My Husband",
    "link": "6GaodpBsSpBuUMhmEXhjK2",
    "meta": {
      "rank": 16,
      "category": "True Crime",
      "publisher": "OH NO MEDIA",
      "description": "A true crime podcast that ventures into the darkest crimes with a wife who loves it and a husband who hates it.",
      "image": "https://i.scdn.co/image/ab67656300005f1f71c59677c5c552054308b56f",
      "appleId": "id1508098400",
      "ratings": 10950
    }
  },
  {
    "title": "MrBallen Podcast: Strange, Dark & Mysterious Stories",
    "link": "4NZWQf0wUsaT0tO9unlmra",
    "meta": {
      "rank": 17,
      "category": "True Crime",
      "publisher": "MrBallen",
      "description": "The Strange, Dark and Mysterious delivered in podcast format. ",
      "image": "https://i.scdn.co/image/ab67656300005f1fed8ceae96facfa2091a49730"
    }
  },
  {
    "title": "Paper Ghosts",
    "link": "0etEOvLkkRVmL3dKmAxpHl",
    "meta": {
      "rank": 18,
      "category": "True Crime",
      "publisher": "iHeartPodcasts",
      "description": "When a young college student’s car was abandoned on the side of a busy midwest highway in 1992, police figured it was a runaway case. Nine days later, she was found brutally murdered, nearly 500 miles away. In season 3 of PAPER GHOSTS, investigative journalist and New York Times bestselling true crime author M. William Phelps digs deep into the murder of Tammy Jo Zywicki and uncovers a murky police investigation, a pool of new suspects, and a community of people still desperate for answers.",
      "image": "https://i.scdn.co/image/ab67656300005f1f132fca6b7a355993645efe8b",
      "appleId": "id1526682330",
      "ratings": 5036
    }
  },
  {
    "title": "Conviction",
    "link": "2XquJlPU9ibLYZMH0ZzFwA",
    "meta": {
      "rank": 19,
      "category": "True Crime",
      "publisher": "Gimlet",
      "description": "Max B is a Harlem rapper on the brink of stardom. One night he gets wind of a bag full of cash that’s sitting in an empty hotel room, and he starts scheming. It would be an easy score – in and out, no one gets hurt. But it doesn’t go down like that. It all ends in chaos, kidnapping and a dead body.This is the story of a rapper who risked it all for a bag full of money, a robbery where everything went wrong, a messy trial, and a sentence that makes you question who the justice system works for... and who it works against.Conviction is a podcast anthology series about crime and justice. Each story examines a new case and asks: Who does the justice system work for, and who does it work against?",
      "image": "https://i.scdn.co/image/ab67656300005f1f3e23ff97ac838287b69fda46",
      "appleId": "id1623501119",
      "ratings": 2
    }
  },
  {
    "title": "My Favorite Murder with Karen Kilgariff and Georgia Hardstark",
    "link": "0U9S5J2ltMaKdxIfLuEjzE",
    "meta": {
      "rank": 20,
      "category": "True Crime",
      "publisher": "Exactly Right",
      "description": "Lifelong fans of true crime stories Karen Kilgariff and Georgia Hardstark tell each other their favorite tales of murder and hear hometown crime stories from friends and fans.",
      "image": "https://i.scdn.co/image/ab67656300005f1f03096b673a85bf2c17e3c68d",
      "appleId": "id1074507850",
      "ratings": 156685
    }
  },
  {
    "title": "Lights Out",
    "link": "3SfSNbkVrfz3ceXmNr0lZ4",
    "meta": {
      "rank": 21,
      "category": "True Crime",
      "publisher": "Mile Higher Media",
      "description": "Lights out everybody, turn everything off, sit back and relax while your mind is taken on a dark and twisted journey filled with thrills and chills. Each week Josh will take you through a dark story, case or event involving a wide range of topics including the occult, hauntings, cryptids, alien abductions, serial killers and demonic possession. So if you’re looking for a chill creepy paranormal and true crime podcast to escape with look no further than Lights Out. New episodes released every Friday, make sure you subscribe and follow the show on social media @lightsoutcast",
      "image": "https://i.scdn.co/image/ab67656300005f1f69875efba0989b81ee16321b",
      "followers": 15900,
      "appleId": "id1505843600",
      "ratings": 7211
    }
  },
  {
    "title": "Suspect",
    "link": "57n3Abokr4RKNLRp3IyKoq",
    "meta": {
      "rank": 22,
      "category": "True Crime",
      "publisher": "Wondery | Campside",
      "description": "Suspect is an investigative series about mislaid justice and the kinds of weighty decisions that detectives, lawyers, and jurors make every day - decisions that, once made, are almost impossible to reverse.Season 2: Vanished in the Snow chronicles the disappearance of 12-year-old Jonelle Matthews. For three and a half decades, her disappearance was a mystery – a riddle neither authorities nor her family members could solve. The residents of her cloistered Colorado hometown had scoured every inch of prairie. The President of the United States appealed to journalists to help. Jonelle’s smiling face was printed on milk cartons nationwide. Still, every lead had fizzled. Every person of interest had turned out to be a dead end. Then, in 2019, Jonelle’s remains were unearthed near the foothills of the Rocky Mountains. With the discovery came troubling new questions: a man obsessed with the case also be her abductor and murderer? Had the truth been hiding in plain sight the entire time?Follow Suspect Season 2: Vanished in the Snow on Amazon Music or wherever you get your podcasts. You can listen early and ad-free by subscribing to Wondery+ in Apple Podcasts or the Wondery AppSeason 1 features a whodunit-style search for a holiday party killer. An apartment complex hosts a big Halloween party with themed rooms and costumed partygoers. By the end of the night one of the party’s hosts is murdered. And the partygoers are the main suspects in the eyes of the police: was it the guy in the devil mask, the guy dressed as Jesus, the bank robber, the construction worker? As a complex investigation winds its way through forensic evidence, witness testimony, DNA, and even a psychic, the police zero in on one suspect in particular -- but why? ",
      "image": "https://i.scdn.co/image/ab67656300005f1fd00b63cfccb0c1f2add32046",
      "appleId": "id1580881826",
      "ratings": 5439
    }
  },
  {
    "title": "Solved Murders: True Crime Mysteries",
    "link": "4t4nuhMponRkNpX6xKFVNZ",
    "meta": {
      "rank": 23,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "To commemorate our fourth anniversary, Parcast and the team behind Unsolved Murders are taking a closer look at what it takes to catch a killer. In the new series Solved Murders: True Crime Mysteries, you'll follow the clues and uncover the missing pieces to some of history's most gripping cases. Every Wednesday, join hosts Carter and Wenndy as they explore the days, months, and even years leading up to a killer being caught. Each episode plays out like a classic murder mystery—where the final reveal is nearly as shocking as the murder itself. Solved Murders: True Crime Mysteries is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1f428a1f57ee019041de712b67"
    }
  },
  {
    "title": "The Deck",
    "link": "4tBHDbvre02vPEWMAFmzvB",
    "meta": {
      "rank": 24,
      "category": "True Crime",
      "publisher": "audiochuck",
      "description": "For years, some law enforcement agencies have replaced the faces of traditional playing card decks with images of missing and murdered people and distributed those cards in prisons hoping inmates would come forward with information needed to crack these cold cases wide open.  Now, audiochuck is dealing you in.  Each week, we will be working with investigators and family members to bring you the details of some of the coldest cases from around the country in hopes that someone listening can finally bring these victims the justice they deserve.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0ff1e66cb111bf525b2a3cbf",
      "appleId": "id1603011962",
      "ratings": 6084
    }
  },
  {
    "title": "Morning Cup of Murder",
    "link": "15iWCbU7QoO23EndPEO6aN",
    "meta": {
      "rank": 25,
      "category": "True Crime",
      "publisher": "Morning Cup of Murder",
      "description": "Ever wonder what crime took place on today's date in true crime history? If so, sit back and grab a cup of coffee as you enjoy your daily dose of True Crime. Your host, Korina Biemesderfer, guides you through a dark history lesson, with tales of murder, abduction, serial killers, cults, and more in this short-form DAILY true crime podcast, that has been downloaded over 20 Million times. Remember, stay safe.  #truecrime #dailytruecrime #truecrimepodcast",
      "image": "https://i.scdn.co/image/ab67656300005f1f3b00fe5b10b6645464598c87",
      "appleId": "id1462365038",
      "ratings": 545
    }
  },
  {
    "title": "In the Shadows",
    "link": "0IXIcljmtSdJv2bfUDd61K",
    "meta": {
      "rank": 26,
      "category": "True Crime",
      "publisher": "Casefile Presents",
      "description": "In The Shadows delves into a riveting unsolved mystery from 1991. When the body of a young woman is discovered by two terrified boys in the desert near Bakersfield, California, authorities quickly target her popular star-athlete boyfriend. The case - one of the most controversial in Kern County’s history - quickly drew national media attention, and the ensuing trials divided the community and sparked a heated debate. Despite that, the perpetrator of this horrific crime remained unpunished. 32 years after the murder, a fresh investigation conducted by this podcast takes an unexpected turn when several individuals reveal shocking information previously unknown by authorities and the public alike.From Casefile Presents, In The Shadows is available exclusive on Wondery+",
      "image": "https://i.scdn.co/image/ab67656300005f1f237b2116e2533cf9aa1ffb20",
      "appleId": "id1658887127",
      "ratings": 5
    }
  },
  {
    "title": "BINGED",
    "link": "36SDVKB2MEWpFGVs9kRgQ7",
    "meta": {
      "rank": 27,
      "category": "True Crime",
      "publisher": "OH NO MEDIA",
      "description": "A True Crime Podcast with one goal. Shining light on cases with a common theme using a new mini-series format. Multiple episodes drop every other week… and every drop dives into different cases with a similar aspect. These killers are more alike than we think…",
      "image": "https://i.scdn.co/image/ab67656300005f1f370a6592464bca48f569243a",
      "appleId": "id1662304327",
      "ratings": 1092
    }
  },
  {
    "title": "White Lies",
    "link": "12yZ2j8vxqhc0QZyRES3ft",
    "meta": {
      "rank": 28,
      "category": "True Crime",
      "publisher": "NPR",
      "description": "On the morning of August 21, 1991, a group of Cuban detainees took over a federal prison in Talladega, Alabama, and demanded their freedom. But how did they get here? And what became of them after? In season two of NPR's Pulitzer-finalist show, we unspool a decades-long story about immigration, indefinite detention, and a secret list. It's a story about a betrayal at the heart of our country's ideals. And in charting a course to our current moment of crisis at the border, we expose the lies that bind us together.Support in-depth storytelling that matters by subscribing to Embedded+ and unlock early access to new episodes and sponsor-free listening. Learn more at plus.npr.org/embedded",
      "image": "https://i.scdn.co/image/ab67656300005f1f717e15a8e535fa60c4558099",
      "followers": 8882587,
      "appleId": "id1462650519",
      "ratings": 11768
    }
  },
  {
    "title": "Devil in the Dorm",
    "link": "3a9cBl0qulSRpopYBjrgMW",
    "meta": {
      "rank": 29,
      "category": "True Crime",
      "publisher": "Law&Crime ",
      "description": "In late 2010, a middle-aged man moved into his daughter's college dorm and created what has all the hallmarks of a cult. Over the decade that followed, he extorted millions of dollars from vulnerable young adults through violence, psychological torture, and forced sex work. Actress and Director Elisabeth Rohm narrates Law&Crime's 6-part investigative series, which draws from thousands of pages of transcripts, exhibits, audio files, and video recordings from a federal trial and explores the actions and motives of Larry Ray. This is Law&Crime’s Devil in the Dorm.Follow Devil in the Dorm only on Wondery+. You can listen exclusively by subscribing to Wondery+ in Apple Podcasts or the Wondery App",
      "image": "https://i.scdn.co/image/ab67656300005f1f5bd461df62ef418bd17089d5",
      "appleId": "id1667678268",
      "ratings": 65
    }
  },
  {
    "title": "Something Was Wrong",
    "link": "3GptGES42jdzOygpz7Qvf8",
    "meta": {
      "rank": 30,
      "category": "True Crime",
      "publisher": "Tiffany Reese | Wondery",
      "description": "Something Was Wrong is an Iris Award-winning true-crime docuseries about the discovery, trauma, and recovery from shocking life events and abusive relationships.",
      "image": "https://i.scdn.co/image/ab67656300005f1fecd29cb79da12e17f5bbb466",
      "followers": 18670,
      "appleId": "id1447286743",
      "ratings": 18670
    }
  },
  {
    "title": "Unsolved Mysteries",
    "link": "1TKOrBUNad9xDiGOkysNSA",
    "meta": {
      "rank": 31,
      "category": "True Crime",
      "publisher": "Cosgrove Meurer Productions, Inc. + Cadence13",
      "description": "Welcome to the official Unsolved Mysteries podcast from the original creators of the iconic television series, presented by Cadence13. Join our host Steve French each week as we present all new mysteries, from terrifying abductions to bizarre paranormal encounters, heinous killers and unexplained deaths. For every mystery, there is someone, somewhere who knows the truth. Perhaps it's you. ",
      "image": "https://i.scdn.co/image/ab67656300005f1fbe6f5b18aad04a56cff409e1",
      "followers": 57471,
      "appleId": "id1549903604",
      "ratings": 2963
    }
  },
  {
    "title": "Crimehub: A True Crime Podcast",
    "link": "3lDOVjujdwyLS5l3CTSas2",
    "meta": {
      "rank": 32,
      "category": "True Crime",
      "publisher": "Crimehub",
      "description": "Need your true crime fix? You've come to the right place. Listen to the most mysterious and unbelievable true crimes in modern history. Click the follow button to receive all notifications. 🔔   * * *  COPYRIGHT WARNING: The use of any affiliated audio of these episodes is not allowed, as it is a direct violation of copyright law and will result in legal action.  Copyright © 2023 Crimehub  #crimehub #truecrime #truecrimestories #truecrimepodcast",
      "image": "https://i.scdn.co/image/ab67656300005f1fcb2be05b740e57682c6ad956",
      "appleId": "id1596610770",
      "ratings": 144
    }
  },
  {
    "title": "Sword and Scale",
    "link": "2dzMey4yRYKX5NWKp8zPrd",
    "meta": {
      "rank": 33,
      "category": "True Crime",
      "publisher": "Incongruity",
      "description": "Sword and Scale is an internet radio show and website covering the dark underworld of crime and the criminal justice system’s response to it. The first episode launched January 1st, 2014 and feature stories of murder, abduction, rape, and even more bizarre forms of crime. It’s the purest form of true-crime where the raw uncensored audio tells the story. Everything from 911 calls to court testimony, interviews with victims and sometimes with perpetrators give listeners a 360 degree look at the seedy underbelly of human nature and so-called civilized society. Told from an everyman's point of view, Sword and Scale goes beyond the news clips and the sensationalist headlines to hold up a mirror to the audience and ask, \"Is it us versus them? Or are we just like 'them' too?\"  Sword and scale proves that the worst monsters are real.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0be5e9aef731e62ab5487870",
      "appleId": "id790487079",
      "ratings": 57443
    }
  },
  {
    "title": "Cold Cases",
    "link": "6lbQMN79nK9kRXn6ZGpLaK",
    "meta": {
      "rank": 34,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "Every unsolved crime leaves us with a nagging sense that just one witness, one piece of evidence, could change everything. Join us Mondays to revisit cases that ran cold for decades. Some had breakthroughs that closed the file. Others remain open still today. From the network that brings you Serial Killers, Disappearances, Solved Murders, and more, this is Cold Cases — a Spotify Original from Parcast. New episodes Mondays.",
      "image": "https://i.scdn.co/image/ab67656300005f1fb1d2cc81d1c9046e07a8dd53",
      "appleId": "id1391263284",
      "ratings": 11
    }
  },
  {
    "title": "Deathbed Confessions",
    "link": "7uJesNgQL4E3r60Rl1Bsfo",
    "meta": {
      "rank": 35,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "Imagine living with a secret so big, if anyone were to find out, it would change everything. From illicit affairs and fake identities to heists and murder — do you think you could take a secret like that to the grave? Every week, discover the most explosive things people have admitted to moments before the end. Deathbed Confessions is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa4b585eba979afeade869cec"
    }
  },
  {
    "title": "This Is Actually Happening",
    "link": "0TvsB5KtaRNudHGbVzVi7L",
    "meta": {
      "rank": 36,
      "category": "True Crime",
      "publisher": "Wondery",
      "description": "What if your mother left to follow a cult… or you woke up in a morgue… or if your boat got caught in a storm and began to sink -- what would you do?   This is Actually Happening brings you extraordinary true stories of life-changing events told by the people who lived them. From a man who finds out a celebrity crush isn’t who she seems to a woman stranded in a Mexican desert fighting to survive, these stories will have you on the edge of your seat waiting to hear what happens next.New episodes come out every Tuesday for free. Listen 1-week early and to exclusive past episodes - all ad-free - with Wondery+ or Amazon Music with a Prime membership or Amazon Music Unlimited subscription.",
      "image": "https://i.scdn.co/image/8bba7970564c65e0757e2c0f134e32a47ab766f1",
      "appleId": "id497227384",
      "ratings": 7833
    }
  },
  {
    "title": "Let's Not Meet: A True Horror Podcast",
    "link": "5mrS2aDwNdAAwlqRkvNVFd",
    "meta": {
      "rank": 37,
      "category": "True Crime",
      "publisher": "Andrew Tate",
      "description": "True horror stories written by those that made it out alive. First person accounts narrated and produced by Andrew Tate in an anthology of terror and suspense. To hear your story on the show, send it to letsnotmeetstories@gmail.com",
      "image": "https://i.scdn.co/image/ab67656300005f1f1381ff17bf7d787c59a4feb7",
      "appleId": "id1249754020",
      "ratings": 6875
    }
  },
  {
    "title": "Disappearances",
    "link": "3mKEfFdAOyb9iaBcOwANir",
    "meta": {
      "rank": 38,
      "category": "True Crime",
      "publisher": "Parcast",
      "description": "In 2020, after years spent searching for answers, Sarah Turney used social media to help bring justice to her sister Alissa’s nearly two decades-long disappearance. Now she’s teaming up with Parcast to explore the many reasons people disappear and the impact their absences can have on those left behind. Disappearances is a Spotify Original from Parcast. Catch a new episode every Thursday, free on Spotify.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc4218d97c0c167bf95afa59b",
      "appleId": "id1577613725",
      "ratings": 520
    }
  },
  {
    "title": "Truth and Lies: The Informant",
    "link": "2ypAjV4lONtXXakEpT5omY",
    "meta": {
      "rank": 39,
      "category": "True Crime",
      "publisher": "ABC News",
      "description": "In 2016, a group of men in rural Kansas started meeting in secret. They spent months forming a militia group and plotting what would’ve been one of the worst domestic terror attacks in U.S. history -- if it hadn't been stopped. \"Truth and Lies: The Informant\" tells the remarkable story of an ordinary man who infiltrated this dangerous group as an FBI informant and risked his life to save others. Season 1, \"Truth and Lies: Jeffrey Epstein,\" covered the rise and fall of the notorious sex offender and financier and told the stories of women who fought to have their voices heard in an effort to bring Epstein to justice.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc0fd4002ecdb9e4451500fd3",
      "appleId": "id1492759205",
      "ratings": 2680
    }
  },
  {
    "title": "True Crime Daily The Podcast",
    "link": "5MCQgSSVQEPB6ME2jSy9u2",
    "meta": {
      "rank": 40,
      "category": "True Crime",
      "publisher": "True Crime Daily",
      "description": "True Crime Daily The Podcast covers murders, scams, investigations and unsolved crimes across the country every week.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd427931d6a342247d11d594c",
      "appleId": "id1451999167",
      "ratings": 937
    }
  },
  {
    "title": "Bone Valley",
    "link": "5ZNyfZVK93493scltYssSf",
    "meta": {
      "rank": 41,
      "category": "True Crime",
      "publisher": "Lava for Good Podcasts",
      "description": "​​In 1987, 18-year-old Michelle Schofield was found dead in a phosphate pit in Florida. Two years later, her husband Leo was convicted and sentenced to life in prison. Fifteen years later, previously unidentified fingerprints matched Jeremy Scott--a violent teenager who lived nearby. Jeremy has since confessed to Michelle’s murder. Yet Leo Schofield remains behind bars. In this groundbreaking podcast, Bone Valley host Gilbert King uncovers startling new evidence that Jeremy is responsible for a string of murders. King is the author of the Pulitzer Prize-winning book, Devil in the Grove, which led to the exonerations of four innocent men. Bone Valley is a production of Lava for Good Podcasts in association with Signal Co. No1.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa65cf98b615ae8c893134cf5",
      "appleId": "id1643974551",
      "ratings": 2438
    }
  },
  {
    "title": "20/20",
    "link": "3ghsL8CzhRaJv0qzREZ9nU",
    "meta": {
      "rank": 42,
      "category": "True Crime",
      "publisher": "ABC News",
      "description": "Unforgettable true crime mysteries, exclusive newsmaker interviews, hard-hitting investigative reports and in-depth coverage of high profile stories.",
      "image": "https://i.scdn.co/image/ab67656300005f1fdbe6918b5cb19cb6c0c3614b",
      "appleId": "id987967575",
      "ratings": 4419
    }
  },
  {
    "title": "Murder in Miami",
    "link": "2RtBlo8AEmy2eEgYmY1tFc",
    "meta": {
      "rank": 43,
      "category": "True Crime",
      "publisher": "iHeartPodcasts",
      "description": "In the 1980s crime journalist Phil Stanford dove into the decadent and dangerous world of Miami just as the city was becoming the cocaine- and murder- capital of the United States. His path would place him in the crosshairs of a federal investigation focusing on a mysterious and controversial drug smuggling pilot who claimed to be an operative of the American government- all while flaunting his extensive illicit activity. Murder in Miami traces the connection between the murder of a missing Miami private investigator to the sprawling roots of an international money laundering scheme as Stanford tries to make sense of his role in a surreal story of spies, smugglers, killers and corruption. All reaching to the highest levels on both sides of the law.",
      "image": "https://i.scdn.co/image/ab67656300005f1f426f6cda079b9440ef453a99"
    }
  },
  {
    "title": "48 Hours",
    "link": "0UetHF8bYSGBtDsjVl4GDv",
    "meta": {
      "rank": 44,
      "category": "True Crime",
      "publisher": "CBS News Radio",
      "description": "One of television's most popular true-crime series adapted for your ears. Follow along with 48 Hours every week as award-winning CBS News correspondents investigate the most intriguing crime and justice cases that touch on all areas of the human experience.Watch 48 Hours Saturday 10/9c on CBS and Paramount+ and hear all new episodes every Sunday.  ",
      "image": "https://i.scdn.co/image/ab67656300005f1f2143ee3fea0f7bd6d83faaa8",
      "appleId": "id965818306",
      "ratings": 5029
    }
  },
  {
    "title": "RedHanded",
    "link": "0emVYc04B4y5UzBIvA0axo",
    "meta": {
      "rank": 45,
      "category": "True Crime",
      "publisher": "RedHanded",
      "description": "RedHanded the podcast jumps head first into all manner of macabre madness. We cover everything from big time serial killers (and those you may never have heard of), to hauntings, possessions, disturbing mysteries, bizarre whodunits and basically anything that tickles our creepy fancy. So, join us, plug in, sit back and prepare for scares.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa320278fdb6d252ad84fb058",
      "appleId": "id1250599915",
      "ratings": 5242
    }
  },
  {
    "title": "Tales from the Break Room",
    "link": "4BGHdnQuX6frU5SfKXCi0T",
    "meta": {
      "rank": 46,
      "category": "True Crime",
      "publisher": "Eeriecast Network",
      "description": "When you're focused on work, you don't expect your next hour on the clock to be the most horrifying in your life. In Tales from the Breakroom, folks from around the world send us their scariest workplace encounters and we narrate them to you. Enjoy, and try not to clock out forever... Submit your scariest work experiences at https://www.eeriecast.com/submit",
      "image": "https://i.scdn.co/image/ab67656300005f1f96584d6e6e3e64ac55b29f55",
      "appleId": "id1621075170",
      "ratings": 382
    }
  },
  {
    "title": "Murder In America",
    "link": "7didcuJyAUG4B3a5RbdDEI",
    "meta": {
      "rank": 47,
      "category": "True Crime",
      "publisher": "Blood In The Sink Productions",
      "description": "MURDER IN AMERICA is a true crime podcast that takes a state-by-state look at the most infamous homicides across the United States of America. Co-hosted by Courtney Shannon & Colin Browen (of \"The Paranormal Files\"), the two delve deep into the darkest tales of murder from each and every state, featuring two stories from a different state every week. Their passion for true crime, along with Colin's career in investigating paranormal activity gives the two a fresh outlook on these crimes, and allows them to gain the deepest perspectives possible when analyzing the grisly details of these horrific acts. Sometimes, you can't help but wonder... the dead don't talk... or DO they? Welcome, to Murder in America. --- New episodes are posted every Friday. -- If you LIKE what we do, you can gain access to BONUS PODCASTS by becoming a Patron!: https://www.patreon.com/murderinamerica -- FOLLOW US ON INSTAGRAM: https://www.instagram.com/murderinamerica/ -- FOLLOW US ON TWITTER: https://twitter.com/murderinamerica -- FOLLOW COLIN'S PARANORMAL YOUTUBE CHANNEL (523,000 Subscribers Already... This Is How We Started!): https://www.youtube.com/theparanormalfilesofficialchannel -- FOLLOW COURTNEY ON INSTAGRAM!: https://www.instagram.com/courtshan/ - FOLLOW COLIN ON INSTAGRAM!: https://www.instagram.com/colinbrowen/",
      "image": "https://i.scdn.co/image/ab67656300005f1f578c3efd4cec5a8c0cc9dcf3",
      "appleId": "id1547409175",
      "ratings": 3120
    }
  },
  {
    "title": "Mile Higher",
    "link": "3HMLJYY1FQQrtY20iAQ7M5",
    "meta": {
      "rank": 48,
      "category": "True Crime",
      "publisher": "Mile Higher Media",
      "description": "Crime. Conspiracy. Cognizance. Welcome to Mile Higher hosted by husband & wife duo Josh Thomas and Kendall Rae! Our show focuses on True Crime but we delve into many other topics including conspiracy theories, unexplained phenomena, metaphysics, futurism, ancient civilizations and news stories the mainstream media doesn't cover. Our guests include experts in these topics as well as like-minded individuals who share our passion for uncovering the truth and exploring the mysteries of our universe. Come chill with us every Monday and prepare to take your mind a mile higher! Watch the show on YouTube every Wednesday!",
      "image": "https://i.scdn.co/image/ab67656300005f1faec34167bb7a8182200bed4d",
      "appleId": "id1332383970",
      "ratings": 18988
    }
  },
  {
    "title": "The Lets Read Podcast",
    "link": "6BVRG4GxyOpflycvaWZ2DE",
    "meta": {
      "rank": 49,
      "category": "True Crime",
      "publisher": "The Lets Read Podcast",
      "description": "The Lets Read Podcast centers around narrating True Scary Experiences from real people, just like yourself. Ranging from creepy stalkers to paranormal encounters with the other side. My goal is to lull you into beautiful nightmares.  This Podcast updates every Tuesday at 12pm EST!  Catch all the new stories, Mon/Wed/Friday at 7pm EST on my YouTube channel, Lets Read!",
      "image": "https://i.scdn.co/image/e41674ae79a5f09fefe5c310264fd78ab21f1b80",
      "appleId": "id1432242042",
      "ratings": 3864
    }
  },
  {
    "title": "Anatomy of Murder",
    "link": "1ZjVlC0qUx4K6QoEvr3Cxj",
    "meta": {
      "rank": 50,
      "category": "True Crime",
      "publisher": "audiochuck",
      "description": "A murder case has many layers: the victim, the crime, and the investigation. To truly understand it, you need to dissect each piece of a tragic puzzle. Join Anna-Sigga Nicolazzi and Scott Weinberger every Wednesday for an insider’s perspective, as they reveal to you the Anatomy of Murder.",
      "image": "https://i.scdn.co/image/ab67656300005f1fea7ef1ac2e329c2d74da0ddc",
      "appleId": "id1532894981",
      "ratings": 934
    }
  }
]