[
  {
    "title": "Anything Goes with Emma Chamberlain",
    "link": "5VzFvh1JlEhBMS6ZHZ8CNO",
    "meta": {
      "rank": 1,
      "category": "Society & Culture",
      "publisher": "Emma Chamberlain and Ramble",
      "description": "Emma prefers to share her thoughts with a microphone rather than a physical human being, so thank god she has a podcast. Recorded from the comfort of her bed, Emma talks at length about whatever is on her mind every week. Anything really does go on this podcast. Sometimes philosophy, sometimes a random story from 10 years ago, sometimes advice, and sometimes nothing at all. You never know what you are going to get, but that’s what keeps it interesting. New episodes every Thursday.",
      "image": "https://i.scdn.co/image/ab67656300005f1fcb4d76d5d08a010ce799dbb9",
      "appleId": "id1458568923",
      "ratings": 59805
    }
  },
  {
    "title": "The Unplanned Podcast",
    "link": "1ToDA4ufQuWuEgMq07zN6t",
    "meta": {
      "rank": 2,
      "category": "Society & Culture",
      "publisher": "Matt & Abby",
      "description": "Schedules? We don't know them…. Five-year plan? NOPE!",
      "image": "https://i.scdn.co/image/ab67656300005f1fff95936acc282dbb0b43dc9e",
      "appleId": "id1669604504",
      "ratings": 1679
    }
  },
  {
    "title": "Stuff You Should Know",
    "link": "0ofXAdFIQQRsCYj9754UFx",
    "meta": {
      "rank": 3,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "If you've ever wanted to know about champagne, satanism, the Stonewall Uprising, chaos theory, LSD, El Nino, true crime and Rosa Parks, then look no further. Josh and Chuck have you covered.",
      "image": "https://i.scdn.co/image/ab67656300005f1f136cd5352cc22be3a1f6be1f",
      "followers": 9267,
      "appleId": "id278981407",
      "ratings": 66746
    }
  },
  {
    "title": "Alphabet Boys",
    "link": "0QLFkKJYdXGKgxL1WBlII0",
    "meta": {
      "rank": 4,
      "category": "Society & Culture",
      "publisher": "Western Sound and iHeartPodcasts",
      "description": "Alphabet Boys reveals the secret investigations of the FBI, CIA, DEA, ATF, and other alphabet agencies. Hosted by journalist Trevor Aaronson, this podcast exposes secret undercover recordings that the government never wanted you to hear, along with the entrapment schemes federal agents set up to target unsuspecting Americans. We explore cases that are both dangerous and absurd while asking this question: Are America’s top cops catching criminals -- or creating them? Season one is “Trojan Hearse.”  During the rage-filled summer of 2020, a mysterious, cigar-smoking antifa warrior rolls into town. He wears military fatigues, speaks with a raspy voice, and drives a hearse filled with guns. He also keeps a very big secret.  Alphabet Boys is a production of Western Sound and iHeartPodcasts.",
      "image": "https://i.scdn.co/image/ab67656300005f1f84fbe6564442dda344ee5ec4",
      "appleId": "id1668980612",
      "ratings": 136
    }
  },
  {
    "title": "Blowback",
    "link": "2pibBnPuHqKr07hxEMZE41",
    "meta": {
      "rank": 5,
      "category": "Society & Culture",
      "publisher": "Blowback",
      "description": "A podcast about American Empire.",
      "image": "https://i.scdn.co/image/ab67656300005f1f825610534350ff0dc4ba0354",
      "followers": 34597,
      "appleId": "id1502178774",
      "ratings": 2069
    }
  },
  {
    "title": "Date Yourself Instead",
    "link": "6ie2ywivlNvFCO8LLJYgo7",
    "meta": {
      "rank": 6,
      "category": "Society & Culture",
      "publisher": "Lyss Boss",
      "description": "You’ve made it to Date Yourself Instead, a podcast intended to inspire you to become the best version of yourself. In 2021, social media personality Lyss started a self-love series on TikTok which amassed over 100+ million views on her videos and counting. In this podcast, she gets candid about her relationship experiences, and touches on other topics including business, beauty, wellness, and so much more. Welcome to the #dateyourselfinstead movement. Episodes every Monday. Support this podcast: https://anchor.fm/lyss-boss5/support",
      "image": "https://i.scdn.co/image/ab67656300005f1f60a21a055a6289cdf7f377ae",
      "appleId": "id1644417703",
      "ratings": 437
    }
  },
  {
    "title": "Shawn Ryan Show",
    "link": "5eodRZd3qR9VT1ip1wI7xQ",
    "meta": {
      "rank": 7,
      "category": "Society & Culture",
      "publisher": "Shawn Ryan",
      "description": "The \"Shawn Ryan Show\" is hosted by Shawn Ryan, former U.S. Navy SEAL, CIA Contractor, and Founder of Vigilance Elite. We tell REAL stories about REAL people from all walks of life. We discuss the ups and downs, wins and losses, successes and struggles, the good and bad in a respectful but candid way with our guest. We're better than entertainment, we're the REAL thing. Please enjoy the show.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6e7dbde349feeaf2c0b50b49",
      "followers": 11576,
      "appleId": "id1492492083",
      "ratings": 17677
    }
  },
  {
    "title": "We Can Do Hard Things with Glennon Doyle",
    "link": "0eFL5HJejQHZrdgAFdPnOm",
    "meta": {
      "rank": 8,
      "category": "Society & Culture",
      "publisher": "Glennon Doyle & Cadence13",
      "description": "I’m Glennon Doyle, author of Untamed, the book that was released at the very start of the pandemic and became a lifeline for millions. I watched in awe from my home while this simple phrase from Untamed – WE CAN DO HARD THINGS – the mantra that saved my life twenty years ago, became a worldwide rally cry. Life is freaking hard. We are all doing hard things every day – we love and lose; we forge and end friendships; battle addiction, illness, and loneliness; care for children and parents; struggle in our jobs, our marriages, our divorces; we try to set and hold boundaries – and we fight for equality, purpose, joy, and peace right in the midst of all the hard. On We Can Do Hard Things, my wife Abby Wambach, my sister Amanda Doyle, and I do the only thing that has ever made life easier: We talk honestly about the hard. We laugh and cry and help each other carry the hard so we can all live a little bit lighter and braver, free-er, less alone.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa7b3c6bed851afb89bc5f100",
      "appleId": "id1564530722",
      "ratings": 27039
    }
  },
  {
    "title": "Modern Wisdom",
    "link": "0XrOqvxlqQI6bmdYHuIVnr",
    "meta": {
      "rank": 9,
      "category": "Society & Culture",
      "publisher": "Chris Williamson",
      "description": "Life lessons from the smartest people on the planet.  Including guests like Dr Jordan Peterson, Jocko Willink, Dr Andrew Huberman, Ryan Holiday, James Clear, Robert Greene, Balaji Srinivasan, Steven Pinker, Alex Hormozi, Douglas Murray, Michael Malice, James Smith, Dr David Sinclair, Mark Manson and more.",
      "image": "https://i.scdn.co/image/ab67656300005f1f33b9f7d01c1babd6d88bbfd6",
      "followers": 110678,
      "appleId": "id1347973549",
      "ratings": 777
    }
  },
  {
    "title": "Svetlana! Svetlana!",
    "link": "7IM5F1J2sZgLyyxoGUXCUm",
    "meta": {
      "rank": 10,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "In 1967, Joseph Stalin’s daughter braved her way over the Iron Curtain, secret memoir in tow, and landed in America as the Cold War’s most famous defector. At 40 years old, Svetlana had left everything behind for a new life in the West and the chance to finally share her story. What she found instead — a controversial commune in the Arizona desert built by Frank Lloyd Wright, a whirlwind marriage dictated by destiny, and a Montenegrin matriarch with dreams of immortality — was far more complicated. In Svetlana! Svetlana! neurotic playwright Dan Kitrosser unravels the weird and wild life of his greatest muse.",
      "image": "https://i.scdn.co/image/ab67656300005f1f424a1b312dc99c0f27c2f642",
      "appleId": "id1667321786",
      "ratings": 201
    }
  },
  {
    "title": "Unlocking Us with Brené Brown",
    "link": "4P86ZzHf7EOlRG7do9LkKZ",
    "meta": {
      "rank": 11,
      "category": "Society & Culture",
      "publisher": "Parcast",
      "description": "I’ve spent over 20 years studying the emotions and experiences that bring meaning and purpose to our lives, and if there’s one thing I’ve learned it’s this: We are hardwired for connection, and connecting requires courage, vulnerability, and conversation. I want this to be a podcast that’s real, unpolished, honest, and reflects both the magic and the messiness of what it means to be human. Episodes will include conversations with the people who are teaching me, challenging me, confusing me, or maybe even ticking me off a little. I'll also have direct conversations with you about what I’m learning from new research, and we'll do some episodes dedicated to answering your questions. We don’t have to do life alone. We were never meant to. Unlocking Us is a Spotify Original from Parcast.",
      "image": "https://i.scdn.co/image/ab67656300005f1ff234909e69a68d92ca0af6ca"
    }
  },
  {
    "title": "Stay Free with Russell Brand",
    "link": "1bmU8gqK78sF4iD2OKFKUZ",
    "meta": {
      "rank": 12,
      "category": "Society & Culture",
      "publisher": "Russell Brand",
      "description": "Russell goes under the skin of guests from the world of academia, popular culture and the arts, to help us to understand and see the ulterior truth behind our constructed reality. And have a laugh!",
      "image": "https://i.scdn.co/image/ab67656300005f1fcea4a67982868373212f57b7",
      "appleId": "id1648125917",
      "ratings": 47
    }
  },
  {
    "title": "If Books Could Kill",
    "link": "2khJBoF73ujIATWUFtSxLD",
    "meta": {
      "rank": 13,
      "category": "Society & Culture",
      "publisher": "Michael Hobbes & Peter Shamshiri",
      "description": "The airport bestsellers that captured our hearts and ruined our minds",
      "image": "https://i.scdn.co/image/ab67656300005f1ffd8f47a662d29d10c3898608",
      "followers": 24900,
      "appleId": "id1651876897",
      "ratings": 4279
    }
  },
  {
    "title": "Sold a Story",
    "link": "0tcUMXBFMGMe8w79MM5QCI",
    "meta": {
      "rank": 14,
      "category": "Society & Culture",
      "publisher": "American Public Media",
      "description": "Millions of kids can't read well. Scientists have known for decades how children learn to read but many schools are ignoring the research. They buy teacher training and books that are rooted in a disproven idea. Emily Hanford investigates four authors and a publishing company that have made millions selling this idea.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd95db7068142886b56806d77",
      "appleId": "id1649580473",
      "ratings": 3922
    }
  },
  {
    "title": "Off The Vine with Kaitlyn Bristowe",
    "link": "0zpkJ75eCcGf3yvBTgrGNU",
    "meta": {
      "rank": 15,
      "category": "Society & Culture",
      "publisher": "PodcastOne",
      "description": "Ready to shake things up? Kaitlyn is creating a space where girls (and gents) can feel empowered to be themselves... because there's more to life than Instagram, right? Kaitlyn isn't afraid to keep it real as she talks with her amazing guests! Get ready for lots of laughs, candid convo, taboo topics, unfiltered advice, and wine... lots of wine!",
      "image": "https://i.scdn.co/image/ab67656300005f1f6ac0c24c59d6049125a74743",
      "appleId": "id1240420549",
      "ratings": 20143
    }
  },
  {
    "title": "Making Space with Hoda Kotb",
    "link": "2wFqjJsJq5IPGPN80hqz0V",
    "meta": {
      "rank": 16,
      "category": "Society & Culture",
      "publisher": "Hoda Kotb, TODAY",
      "description": "Where do you draw your strength? Join TODAY’s Hoda Kotb as she continues on a journey of self-discovery and exploration of the resilience of the human spirit. Hoda hears from some of the people she admires most, and whose testimonies of compassion provide lessons for how to make space for whatever it is you may be seeking in life right now. Like Hoda, you’ll leave these talks stronger than when you started and inspired to make space for growth and change in your own life.",
      "image": "https://i.scdn.co/image/ab67656300005f1f460049c54b52a7625ed67eab",
      "appleId": "id1585499926",
      "ratings": 7216
    }
  },
  {
    "title": "REAL ONES with Jon Bernthal",
    "link": "0sgGA3WdqeSDFZJvwAxy06",
    "meta": {
      "rank": 17,
      "category": "Society & Culture",
      "publisher": "Jon Bernthal",
      "description": "Real Ones is a weekly podcast with Jon Bernthal that gives the microphone to some of the most interesting, authentic people living on the front lines of the big issues of our time.  From cops to gang members, soldiers and doctors, activists and first responders, you’re going to hear from people who aren’t pushing any agenda other than honest, open dialogue.  What transpires is informative, funny, and at times heartbreaking – delivered by people you’ll feel an immediate connection to.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd41e9bd6a99a8bd6d83a14cd",
      "followers": 889,
      "appleId": "id1610616073",
      "ratings": 817
    }
  },
  {
    "title": "This American Life",
    "link": "41zWZdWCpVQrKj7ykQnXRc",
    "meta": {
      "rank": 18,
      "category": "Society & Culture",
      "publisher": "This American Life",
      "description": "This American Life is a weekly public radio show, heard by 2.2 million people on more than 500 stations. Another 2.5 million people download the weekly podcast. It is hosted by Ira Glass, produced in collaboration with Chicago Public Media, delivered to stations by PRX The Public Radio Exchange, and has won all of the major broadcasting awards.",
      "image": "https://i.scdn.co/image/67d5b7d5bfe1886209964a747e44d384ec1acc5c",
      "appleId": "id201671138",
      "ratings": 79071
    }
  },
  {
    "title": "What Now",
    "link": "583akX6QLWTvAEZYYk6PjA",
    "meta": {
      "rank": 19,
      "category": "Society & Culture",
      "publisher": "What Now",
      "description": "Life is full of big moments, but that's not what we're here to talk about. We're here to deep dive into that feeling when you finally get what you've been working for and you find yourself thinking...what now?",
      "image": "https://i.scdn.co/image/ab67656300005f1f35c384e59e5e28a331e2d44e",
      "appleId": "id1671074996",
      "ratings": 117
    }
  },
  {
    "title": "Freakonomics Radio",
    "link": "6z4NLXyHPga1UmSJsPK7G1",
    "meta": {
      "rank": 20,
      "category": "Society & Culture",
      "publisher": "Freakonomics Radio + Stitcher",
      "description": "Discover the hidden side of everything with Stephen J. Dubner, co-author of the Freakonomics books. Each week, Freakonomics Radio tells you things you always thought you knew (but didn’t) and things you never thought you wanted to know (but do) — from the economics of sleep to how to become great at just about anything. Dubner speaks with Nobel laureates and provocateurs, intellectuals and entrepreneurs, and various other underachievers.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd8cbc1b0e35fb151ae472695",
      "followers": 636804,
      "appleId": "id354668519",
      "ratings": 27857
    }
  },
  {
    "title": "Am I the Jerk?",
    "link": "0uEkxvRMpxLuuHeyPVVioF",
    "meta": {
      "rank": 21,
      "category": "Society & Culture",
      "publisher": "youtube.com/amithejerk",
      "description": "AM I THE JERK is Voice Actors acting out and discussing stories from reddit and more! youtube.com/amithejerk",
      "image": "https://i.scdn.co/image/ab67656300005f1f8777afc78d9a0cff70527c3a",
      "followers": 2931,
      "appleId": "id1602015344",
      "ratings": 894
    }
  },
  {
    "title": "The Happiness Lab with Dr. Laurie Santos",
    "link": "3i5TCKhc6GY42pOWkpWveG",
    "meta": {
      "rank": 22,
      "category": "Society & Culture",
      "publisher": "Pushkin Industries",
      "description": "You might think you know what it takes to lead a happier life… more money, a better job, or Instagram-worthy vacations. You’re dead wrong. Yale professor Dr. Laurie Santos has studied the science of happiness and found that many of us do the exact opposite of what will truly make our lives better. Based on the psychology course she teaches at Yale -- the most popular class in the university’s 300-year history -- Laurie will take you through the latest scientific research and share some surprising and inspiring stories that will change the way you think about happiness. iHeartMedia is the exclusive podcast partner of Pushkin Industries.",
      "image": "https://i.scdn.co/image/ab67656300005f1fcad1cf743dc23b0d0cb311ae",
      "appleId": "id1474245040",
      "ratings": 13245
    }
  },
  {
    "title": "The Most Dramatic Podcast Ever with Chris Harrison",
    "link": "1DE8pixvPpW1EN8pNRhssr",
    "meta": {
      "rank": 23,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "For two decades, Chris Harrison saw it all. To be honest, maybe too much. Seriously, there are things he just can't unsee. But his nightmares, his lessons, and all that wisdom are now your gain That's right, your greatest podcast dreams have just come true!  Chris Harrison is back. Who knows what he has to say now? You're going to want to find out. It's the most dramatic podcast ever... with Chris Harrison.",
      "image": "https://i.scdn.co/image/ab67656300005f1fb74a92d9f7ebb91ed65f42ee",
      "appleId": "id1660482287",
      "ratings": 2801
    }
  },
  {
    "title": "Ghost Herd",
    "link": "06rkAt1yGIZ3NwjAI2LDie",
    "meta": {
      "rank": 24,
      "category": "Society & Culture",
      "publisher": "KUOW News and Information",
      "description": "A true story of family, fraud, land and power in the American West. Ghost Herd is a joint production of KUOW and Northwest Public Broadcasting, both members of the NPR Network.",
      "image": "https://i.scdn.co/image/ab67656300005f1f03cb4d70f756ff351236049c",
      "appleId": "id1656114483",
      "ratings": 411
    }
  },
  {
    "title": "City of the Rails",
    "link": "41qTEMkddA3FX0PwVRdND8",
    "meta": {
      "rank": 25,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "When journalist Danelle Morton’s daughter skips town to hop trains, she follows her into the train yard, and across America. Join Danelle as she travels the country to understand what drew her daughter into the hidden world of the railroads. Her guides are the rail cops, train engineers, and hobos she meets along the way, each of them with their own extraordinary tales of the beauty and brutality of the rails. A mother/daughter story unfolds across a landscape of vast open spaces and filthy backstreets, as Morton learns how railroads shaped the modern world - from creating our time zones and QR codes, to the first lobbyists and unions. The story of the rails is the story of America, and through 10 episodes, Morton reckons with our history, and her family history, as she tries what she can to bring her daughter home.",
      "image": "https://i.scdn.co/image/ab67656300005f1f886e06b5f44428409628f33e",
      "appleId": "id1664440759",
      "ratings": 172
    }
  },
  {
    "title": "Behind the Bastards",
    "link": "0rOatMqaG3wB5BF4AdsrSX",
    "meta": {
      "rank": 26,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "There’s a reason the History Channel has produced hundreds of documentaries about Hitler but only a few about Dwight D. Eisenhower. Bad guys (and gals) are eternally fascinating. Behind the Bastards dives in past the Cliffs Notes of the worst humans in history and exposes the bizarre realities of their lives. Listeners will learn about the young adult novels that helped Hitler form his monstrous ideology, the founder of Blackwater’s insane quest to build his own Air Force, the bizarre lives of the sons and daughters of dictators and Saddam Hussein’s side career as a trashy romance novelist.",
      "image": "https://i.scdn.co/image/ab67656300005f1f8ee11047ddaf525ef29b172e",
      "followers": 11885,
      "appleId": "id1373812661",
      "ratings": 11885
    }
  },
  {
    "title": "Theories of the Third Kind",
    "link": "7pCVYRoqa0YlMA2iaObF1J",
    "meta": {
      "rank": 27,
      "category": "Society & Culture",
      "publisher": "Theories of the Third Kind | Cumulus Podcast Network",
      "description": "Explore the unknown with us. Conspiracy Theories, Aliens, Paranormal, Demons, Occult, Bigfoot, Reptilians, Cryptozoology, Conspiracies, Supernatural, UFOs. We seek the truth & provide the most interesting, thought-provoking questions & conspiracies. Dedicated to seeking the truth & waking the masses. https://www.TheoriesoftheThirdKind.com",
      "image": "https://i.scdn.co/image/ab67656300005f1fcfab059ead85e015d068c173",
      "appleId": "id1466851347",
      "ratings": 5004
    }
  },
  {
    "title": "Podcrushed",
    "link": "0pHWePUWW56a1ynkppl6mZ",
    "meta": {
      "rank": 28,
      "category": "Society & Culture",
      "publisher": "Penn Badgley, Nava Kavelin, Sophie Ansari",
      "description": "Podcrushed — the podcast where Penn Badgley reads your middle school story-- explores the heartbreak, anxiety and self-discovery of being a teenager. Hosts Penn Badgley, Nava Kavelin, and Sophie Ansari bring you stories and conversations about middle school -  from childhood crushes, to battles with body hair, to schoolyard scuffles. The results are sometimes awkward, sometimes heartwarming, and always relatable.",
      "image": "https://i.scdn.co/image/ab67656300005f1f5bfd9cda2ff3807046b3355c",
      "appleId": "id1622070205",
      "ratings": 489
    }
  },
  {
    "title": "The Ezra Klein Show",
    "link": "3oB5noYIwEB2dMAREj2F7S",
    "meta": {
      "rank": 29,
      "category": "Society & Culture",
      "publisher": "New York Times Opinion",
      "description": "*** Named a best podcast of 2021 by Time, Vulture, Esquire and The Atlantic. *** Each Tuesday and Friday, Ezra Klein invites you into a conversation on something that matters. How do we address climate change if the political system fails to act? Has the logic of markets infiltrated too many aspects of our lives? What is the future of the Republican Party? What do psychedelics teach us about consciousness? What does sci-fi understand about our present that we miss? Can our food system be just to humans and animals alike?",
      "image": "https://i.scdn.co/image/983c20f94f93a163033ede899c0698c428a875cb",
      "appleId": "id1548604447",
      "ratings": 7198
    }
  },
  {
    "title": "High Low with EmRata",
    "link": "1sbjTlSAwpfTXjyDTr3yYg",
    "meta": {
      "rank": 30,
      "category": "Society & Culture",
      "publisher": "EmRata / Sony Music Entertainment / Somethin’ Else",
      "description": "Hi, I’m EmRata, aka Emily Ratajkowski. Maybe you know me from my work as an actress or model, or maybe you’ve read my bestselling book, My Body. I’m interested in marrying everything high and low brow by talking pop culture and happenings that may seem frivolous in a way that raises big questions.    On this podcast, I’ll be talking everything from politics, philosophy, and feminism to sex, TikTok and relationships. Every Tuesday, I’ll host intimate conversations with special guests, including celebs, incredible authors, close friends, and people I admire. In the week’s second episode, I’ll talk about whatever’s happening in the world and what it’s making me think about, including anecdotes, personal opinions and, ideally, some thought provoking questions. Finally, you can subscribe to a third exclusive episode each week where you get to be part of the show. I’ll go through your comments and answer your DMs.     My hope is that this series will be a place where you can come to have fun and take part in thoughtful discourse.    High Low with EmRata is a Sony Music Entertainment, Somethin' Else, and Bitch Era Media production.   Subscribe to ‘High Low: Talk Back’ for exclusive extra episodes every week. Plus, you’ll get all episodes of High Low ad-free.     To bring your brand to life in this podcast, email podcastadsales@sonymusic.com     Find more great podcasts from Sony Music Entertainment at sonymusic.com/podcasts     Learn more about your ad choices. Visit megaphone.fm/adchoices",
      "image": "https://i.scdn.co/image/ab67656300005f1f4d71ec56ce75cc68526063e2",
      "appleId": "id1648732468",
      "ratings": 595
    }
  },
  {
    "title": "Heavyweight",
    "link": "5c26B28vZMN8PG0Nppmn5G",
    "meta": {
      "rank": 31,
      "category": "Society & Culture",
      "publisher": "Gimlet",
      "description": "Maybe you’ve laid awake and imagined how it could have been, how it might yet be, but the moment to act was never right. Well, the moment is here and the podcast making it happen is Heavyweight. Join Jonathan Goldstein for road trips, thorny reunions, and difficult conversations as he backpedals his way into the past like a therapist with a time machine. From Gimlet Media.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6fe10575deee78d69f91e635",
      "appleId": "id1523879006",
      "ratings": 7
    }
  },
  {
    "title": "Girls Next Level",
    "link": "4JstWABabZk3fLty7Rhmyt",
    "meta": {
      "rank": 32,
      "category": "Society & Culture",
      "publisher": "Holly Madison and Bridget Marquardt",
      "description": "Take a trip back to the early 2000's with Holly Madison and Bridget Marquardt, the stars of the E! network's iconic reality show The Girls Next Door. Each week, the girls take you inside the gates of the Playboy Mansion and behind the scenes of the hit show to break down what was real and what was fake. From the wild parties, the backstabbing drama, lifelong friendships and complicated relationships . . . it's here every Monday with a brand new episode of Girls Next Level.",
      "image": "https://i.scdn.co/image/ab67656300005f1faf51091b9dcd1fc5901543a7",
      "appleId": "id1637803173",
      "ratings": 9570
    }
  },
  {
    "title": "Dellara's Diary",
    "link": "1X34WdjDSsPrIwFy5N1DKT",
    "meta": {
      "rank": 33,
      "category": "Society & Culture",
      "publisher": "Dellara",
      "description": "Dive into Dellara's inner world as she navigates the complex and ever-changing intersection between culture, technology, philosophy, and modern trends. In each episode, she delves into how these forces interact and shape our world, both online and off. From examining cultural shifts to exploring the motivations that drive us to everyday musings, this podcast is an unfiltered thought-provoking journey through the interconnected world we live in.",
      "image": "https://i.scdn.co/image/ab67656300005f1f693908f6b2c3ba90f1b38179"
    }
  },
  {
    "title": "The Salice Rose Show",
    "link": "2ylNulTTa42BJkArN7jjJO",
    "meta": {
      "rank": 34,
      "category": "Society & Culture",
      "publisher": "Salice Rose",
      "description": "Follow along with entertainer, Salice Rose, as she dives head-first into life’s most relatable topics while sharing her own personal experiences and incorporating her own raw and comedic twist. Join Salice as she unlocks the door to a more personal and adult experience as she strips away all social media filters and challenges all of the normative expectations of society. Listen in on exclusive, never-before heard secrets and experiences from Salice Rose, herself, that will include personal relationship details, sexual openness and empowerment, challenging and emotional mental health conversations, perspectives regarding the latest drama, and the most intriguing and all-around organic experience imaginable. New episodes every Wednesday.",
      "image": "https://i.scdn.co/image/ab67656300005f1f73871e1a81a693a477a36d9b",
      "appleId": "id1648970866",
      "ratings": 472
    }
  },
  {
    "title": "Scamfluencers",
    "link": "0OMab5B3vorLGoViqrXMxI",
    "meta": {
      "rank": 35,
      "category": "Society & Culture",
      "publisher": "Wondery",
      "description": "You never really know someone…especially online. In today’s world, the power of influence can be the quickest path to money and fame, and it often ends in ruin. These are the stories of the world’s most insidious Scamfluencers. And we are their prey. On Wondery’s new weekly series, join co-hosts Scaachi Koul and Sarah Hagi as they unpack epic stories of deception from the worlds of social media, fashion, finance, health, and wellness. These influencers claim to be everything from charismatic healers to trusted financial insiders to experts in dating. They cast spells over millions. Why do we believe them, and how does our culture allow them to thrive? From Black Swan Murder to a fake social media influencer to an audacious Hollywood Ponzi schemer, each season will take the listener along the twists and turns, the impact on victims, and what’s left when the facade falls away.New episodes come out every Monday for free, with 1-week early access for Wondery+ subscribers. Listen ad-free on Wondery+ or on Amazon Music with a Prime membership or Amazon Music Unlimited subscription.",
      "image": "https://i.scdn.co/image/ab67656300005f1f515037eceb44c003e74efbcb",
      "appleId": "id1616682405",
      "ratings": 3687
    }
  },
  {
    "title": "Unexplained Encounters",
    "link": "3mNZyXkaJPLwUwcjkz6Pv2",
    "meta": {
      "rank": 36,
      "category": "Society & Culture",
      "publisher": "Eeriecast Network",
      "description": "(Formerly the Darkness Prevails Podcast) Host Darkness Prevails brings you Unexplained Encounters, a podcast where everyday folk share their most terrifying and unexplained experiences. From mysterious creatures seen in national forests to supernatural events disrupting peoples' lives, prepare to explore the unexplained. These stories might sound bizarre, but it's up to you to decide which to believe. Submit your story to Unexplained Encounters at darkstories.org",
      "image": "https://i.scdn.co/image/ab67656300005f1ff6a08c260baefeccea39e25c",
      "appleId": "id1152248491",
      "ratings": 3493
    }
  },
  {
    "title": "Scary Story Podcast",
    "link": "6D2fkwIM6qc7FEeWGlJwqK",
    "meta": {
      "rank": 37,
      "category": "Society & Culture",
      "publisher": "Scary Stories",
      "description": "Scary Story Podcast features scary stories about darkness, unexplained phenomena, ghosts, and the paranormal. A collection of short original horror tales written by Edwin Covarrubias. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f75a4b64b6a356f3c8a1766fa",
      "appleId": "id1455395163",
      "ratings": 1905
    }
  },
  {
    "title": "Archetypes",
    "link": "6UfyXZgVAUX1UzF8j5L72t",
    "meta": {
      "rank": 38,
      "category": "Society & Culture",
      "publisher": "Archewell Audio",
      "description": "Archetypes with Meghan - a podcast where we investigate, dissect, and subvert the labels that try to hold women back.",
      "image": "https://i.scdn.co/image/ab67656300005f1fccddbf58bc2d3caac756c6bb"
    }
  },
  {
    "title": "A Bit of Optimism",
    "link": "0wjYlCNxLDgFUUjZMaP6Dx",
    "meta": {
      "rank": 39,
      "category": "Society & Culture",
      "publisher": "Simon Sinek",
      "description": "During these times, we are all having to find new ways to connect.  Join me every week as I talk with people that inspire me, about love, life, leadership, and silver linings. The hope is that we all leave with something I think we need these days… A Bit of Optimism.",
      "image": "https://i.scdn.co/image/ab67656300005f1fb8d12afde962535f3b60e9cc",
      "appleId": "id1515385282",
      "ratings": 1277
    }
  },
  {
    "title": "The Art of Manliness",
    "link": "2vJHmWhhcMQRXtTruuFWTJ",
    "meta": {
      "rank": 40,
      "category": "Society & Culture",
      "publisher": "The Art of Manliness",
      "description": "The Art of Manliness Podcast aims to deepen and improve every area of a man's life, from fitness and philosophy, to relationships and productivity. Engaging and edifying interviews with some of the world's most interesting doers and thinkers drop the fluff and filler to glean guests' very best, potentially life-changing, insights.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6e8e9ac3d539ba3e2fb5794b",
      "appleId": "id332516054",
      "ratings": 12977
    }
  },
  {
    "title": "Where Should We Begin? with Esther Perel",
    "link": "3fKOTwtnX5oZLaiNntKWAV",
    "meta": {
      "rank": 41,
      "category": "Society & Culture",
      "publisher": "Esther Perel Global Media & Gimlet",
      "description": "Listen to the incomparable therapist Esther Perel counsel real couples as they reveal the most intimate, personal, and complicated details of the conflicts that have brought them to her door. This season Esther speaks to a constellation of new relationships: A couple wrestling with the guilt they feel over the happiness their infidelity created. Another trying to make space for their queerness in an outwardly appearing hetero relationship. A set of friends trying to sort out if their childhood friendship needs to continue into adulthood. And Esther checks back in with couples from seasons past to see where they are now as she creates a space for us to hear our own lives and struggles articulated in the stories of others. So....where should we begin?",
      "image": "https://i.scdn.co/image/ab67656300005f1f896d690b0accbac63f8be11e",
      "appleId": "id1237931798",
      "ratings": 12406
    }
  },
  {
    "title": "Philosophize This!",
    "link": "2Shpxw7dPoxRJCdfFXTWLE",
    "meta": {
      "rank": 42,
      "category": "Society & Culture",
      "publisher": "Stephen West",
      "description": "A Free Podcast Dedicated To Sharing The Ideas That Shaped Our World!  Beginner friendly if listened to in order! For anyone interested in an educational podcast about philosophy where you don't need to be a graduate-level philosopher to understand it. In chronological order, the thinkers and ideas that forged the world we live in are broken down and explained.",
      "image": "https://i.scdn.co/image/b01d89d740d3275d16082b5c5e597b12881bec26",
      "appleId": "id659155419",
      "ratings": 13479
    }
  },
  {
    "title": "Hawk vs Wolf Podcast",
    "link": "6ZcNADIeqlXXCCLm1MJny7",
    "meta": {
      "rank": 43,
      "category": "Society & Culture",
      "publisher": "Tony Hawk & Jason Ellis",
      "description": "After both leaving Sirius XM, radio personality Jason Ellis and professional skateboarder Tony Hawk, team up to bring podcasting to a new level. Jason and Tony take an in-depth look at skateboarding, music, and a behind the scenes look at what life is like as a superstar athlete. Every week, Jason and Tony will debate perspectives on cultural and societal themes that tie into entertainment. This is Hawk vs. Wolf!",
      "image": "https://i.scdn.co/image/ab67656300005f1f2c3dabd1a2828f548fed243e",
      "appleId": "id1553164725",
      "ratings": 1055
    }
  },
  {
    "title": "KONCRETE Podcast",
    "link": "4VTLG0HiIZaCjH9gE6NFPq",
    "meta": {
      "rank": 44,
      "category": "Society & Culture",
      "publisher": "Koncrete",
      "description": "Danny’s quest to get smarter.",
      "image": "https://i.scdn.co/image/896e092d1bd8b3a16a9ccb6712566210015f930f",
      "appleId": "id1441238966",
      "ratings": 440
    }
  },
  {
    "title": "Radiolab",
    "link": "2hmkzUtix0qTqvtpPcMzEL",
    "meta": {
      "rank": 45,
      "category": "Society & Culture",
      "publisher": "WNYC Studios",
      "description": "Radiolab is on a curiosity bender. We ask deep questions and use investigative journalism to get the answers. A given episode might whirl you through science, legal history, and into the home of someone halfway across the world. The show is known for innovative sound design, smashing information into music. It is hosted by Lulu Miller and Latif Nasser.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0f5e5d3a9892bdcedf2c72b6",
      "appleId": "id152249110",
      "ratings": 39737
    }
  },
  {
    "title": "Timcast IRL",
    "link": "4r5fNsRtIJffpFjAcemzJP",
    "meta": {
      "rank": 46,
      "category": "Society & Culture",
      "publisher": "Tim Pool",
      "description": "Timcast IRL features Tim Pool and guests discussing issues in culture, news, and politics. Featuring Ian Crossland as co-host and Lydia as live producer.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4da034f69252981688bbb26d",
      "appleId": "id1503517959",
      "ratings": 4688
    }
  },
  {
    "title": "Modern Love",
    "link": "03Er7mSPq9IEewOgbPD3vO",
    "meta": {
      "rank": 47,
      "category": "Society & Culture",
      "publisher": "The New York Times",
      "description": "For 18 years, the Modern Love column has given New York Times readers a glimpse into the complicated love lives of real people. Since its start, the column has evolved into a TV show, three books and a podcast.  Each week, host Anna Martin brings you stories and conversations about love in all its glorious permutations, dumb pitfalls and life-changing moments. New episodes every Wednesday.",
      "image": "https://i.scdn.co/image/65d6c9f308c81ed7ba6b48833eae1aa31088c708",
      "appleId": "id1065559535",
      "ratings": 7630
    }
  },
  {
    "title": "The Black Girl Bravado",
    "link": "7gFGkIIZCyr2j0uxKdMcPP",
    "meta": {
      "rank": 48,
      "category": "Society & Culture",
      "publisher": "Black Girl Bravado",
      "description": "A motivating and encouraging podcast for Black Women everywhere. Candid conversations on self-care, self-love, mental health, wellness and much more. Check out new episodes published every Tuesday, ONLY on Spotify. Connect with us via email at: contact@theblackgirlbravado.com",
      "image": "https://i.scdn.co/image/ab67656300005f1f512c4ec8d86f55b10dc7e34b",
      "appleId": "id1186583079",
      "ratings": 2425
    }
  },
  {
    "title": "Stuff They Don't Want You To Know",
    "link": "5N6g8n6084T5D6Q67yGCUX",
    "meta": {
      "rank": 49,
      "category": "Society & Culture",
      "publisher": "iHeartPodcasts",
      "description": "From UFOs to psychic powers and government conspiracies, history is riddled with unexplained events. You can turn back now or learn the Stuff They Don't Want You To Know ... an audio podcast from iHeartRadio.",
      "image": "https://i.scdn.co/image/ab67656300005f1f20837708ffa6ecedce4c6591",
      "appleId": "id732915228",
      "ratings": 8765
    }
  },
  {
    "title": "Teenager Therapy",
    "link": "1xxFg2YQAByj5YbwPkG2rP",
    "meta": {
      "rank": 50,
      "category": "Society & Culture",
      "publisher": "Teenager Therapy | Flighthouse",
      "description": "Five stressed, sleep-deprived, yet energetic teens sit down and talk about the struggles that come with being a teenager. Is high school really as bad as everyone says? A podcast that's a coming-of-age story portrayed in real-time. A culmination of mistakes and growth and a reminder you're not alone.",
      "image": "https://i.scdn.co/image/f2b0be41187a452b0137e958c0a163f479c984af",
      "appleId": "id1437039510",
      "ratings": 3914
    }
  }
]