[
  {
    "title": "New Heights with Jason and Travis Kelce",
    "link": "1y3SUbFMUSESC1N43tBleK",
    "meta": {
      "rank": 1,
      "category": "Sports",
      "publisher": "Wave Sports + Entertainment",
      "description": "Football’s funniest family duo — Jason Kelce from the Philadelphia Eagles and Travis Kelce from the Kansas City Chiefs — team up to provide next-level access to life in the league as it unfolds. The two brothers and Super Bowl champions drop weekly insights about their games and share unique perspectives on trending NFL news and sports headlines. Plus, entertaining stories from a combined 21 years in the league, off-field interests, and engaging conversations with special guests.     Watch and listen to new episodes every Wednesday during the NFL season & check us out on Instagram, Twitter and Tiktok for all the best moments from the show.",
      "image": "https://i.scdn.co/image/ab67656300005f1f3d8d4f273391ea412f25a0a6",
      "appleId": "id1643745036",
      "ratings": 3400,
      "velocity": 0
    }
  },
  {
    "title": "P1 with Matt and Tommy",
    "link": "20La1QIIVElT4mkc046AIV",
    "meta": {
      "rank": 2,
      "category": "Sports",
      "publisher": "Stak",
      "description": "Matt Gallagher and Tom Bellingham are two diehard F1 fans, here to bring you all the latest news, reaction, predictions and opinions from the best sport in the world. From every Ferrari strategy blunder to spicy off-track controversies, we’ll be in your ears keeping you up to speed. Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f2cb332f0271a580dc80ad830",
      "followers": 62472,
      "appleId": "id1670705840",
      "ratings": 335,
      "velocity": 0
    }
  },
  {
    "title": "Actions Detrimental with Denny Hamlin",
    "link": "2wPp24eC9cAGfUI4xEl1LA",
    "meta": {
      "rank": 3,
      "category": "Sports",
      "publisher": "Dirty Mo Media",
      "description": "Actions Detrimental with Denny Hamlin will give listeners an unfiltered, honest and bold perspective from NASCAR’s most polarizing figure. Hamlin and co-host Jared Allen will unpack the previous race and look forward to upcoming events throughout the Cup Series with candid commentary and insights from the driver’s seat.",
      "image": "https://i.scdn.co/image/ab67656300005f1f26832570ce5bfb0bb7283562",
      "appleId": "id1666603641",
      "ratings": 249,
      "velocity": 0
    }
  },
  {
    "title": "Let’s Go! with Tom Brady, Larry Fitzgerald and Jim Gray",
    "link": "4cfH0rfEFco4Shg1iOECBN",
    "meta": {
      "rank": 4,
      "category": "Sports",
      "publisher": "SiriusXM",
      "description": "Tom Brady, Larry Fitzgerald and Jim Gray are BACK for another season of Let's Go! Enjoy in-depth, insightful, and introspective one-on-one conversations with each of these future HOF football players.  They'll discuss trending stories from on and off the football field and share stories from their personal life.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc884f8befe5195708d8b4beb",
      "appleId": "id1584409759",
      "ratings": 318,
      "velocity": 0
    }
  },
  {
    "title": "The Bill Simmons Podcast",
    "link": "07SjDmKb9iliEzpNcN2xGD",
    "meta": {
      "rank": 5,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "HBO and The Ringer's Bill Simmons hosts the most downloaded sports podcast of all time, with a rotating crew of celebrities, athletes, and media staples, as well as mainstays like Cousin Sal, Joe House, and a slew of other friends and family members who always happen to be suspiciously available.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4861ae328cd5834682f56bd7",
      "followers": 5641107,
      "appleId": "id1043699613",
      "ratings": 27455,
      "velocity": 0
    }
  },
  {
    "title": "Pardon My Take",
    "link": "5ss1pqMFqWjkOpt6Ag0fZW",
    "meta": {
      "rank": 6,
      "category": "Sports",
      "publisher": "Barstool Sports",
      "description": "On \"Pardon My Take,\" Big Cat & PFT Commenter deliver the loudest and most correct sports takes in the history of the spoken word. Daily topics, guests, and an inability to tell what the hosts might be doing will make this your new favorite sports talk show. This is a podcast that will without a doubt change your life for the better- guaranteed, or your money back. *Pretend a reggaeton air horn is going off right now* PMT.You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit barstool.link/PardonMyTake",
      "image": "https://i.scdn.co/image/ab67656300005f1fbb5649725caec3ba6bd55db2",
      "appleId": "id1089022756",
      "ratings": 78001,
      "velocity": 0
    }
  },
  {
    "title": "The Pat McAfee Show 2.0",
    "link": "1ol0jP8hrNHydiAd38G6B1",
    "meta": {
      "rank": 7,
      "category": "Sports",
      "publisher": "Pat McAfee",
      "description": "On The Pat McAfee Show 2.0, Pat McAfee and his friends deliver one of a kind opinions that won't be heard anywhere else. Pat, who played in two Pro Bowls during his eight-year NFL career, brings a fresh take on sports and entertainment to listeners and fans. He is known for speaking his mind and is both relatable and refreshing. His player’s insight, electric storytelling, and robust sense of humor have helped him build a huge and loyal fan base with more than 3 million social media followers. Presented by FanDuel, The Pat McAfee Show 2.0 promises to inform, intrigue, and entertain. Cheers.",
      "image": "https://i.scdn.co/image/ab67656300005f1fffe1a64377acf2178bccaa11",
      "appleId": "id1435183458",
      "ratings": 17788,
      "velocity": 0
    }
  },
  {
    "title": "Bussin' With The Boys",
    "link": "55wzNQYr7gYXbsiIeTQTrg",
    "meta": {
      "rank": 8,
      "category": "Sports",
      "publisher": "Barstool Sports",
      "description": "Barstool Sports Presents Bussin' With The Boys. Get on the bus with NFL players Will Compton & Taylor Lewan! The Boys let you in on their hilarious, high-energy, and often heartfelt conversations. Topics range from exclusive NFL stories to candid chats with personalities from all industries to out-of-left-field hot takes on things you and your friends only discuss behind closed doors. Sometimes they chat with a guest, sometimes it's just the two of them, but it's always a good time when you're Bussin' With The Boys.  And yes, this is the podcast where Mike Vrabel said he'd cut his piece off for a Super Bowl. BWTB Shop: bit.ly/BWTB-Merch YouTube: bit.ly/BWTB_YouTube Apple Podcasts: bit.ly/BWTB_Apple Spotify: bit.ly/BWTB_Spotify Instagram: instagram.com/bussinwtb Twitter: twitter.com/BussinWTBYou can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit barstool.link/bussinwtb",
      "image": "https://i.scdn.co/image/ab67656300005f1fa020a58204b57616900830cf",
      "followers": 152102,
      "appleId": "id1464240720",
      "ratings": 7994,
      "velocity": 0
    }
  },
  {
    "title": "The Dale Jr. Download",
    "link": "3kimBZcCqsscKHMgjjfU3j",
    "meta": {
      "rank": 9,
      "category": "Sports",
      "publisher": "Dirty Mo Media",
      "description": "NASCAR’s 15-time Most Popular Driver and winner of two Daytona 500s, Dale Earnhardt Jr., hosts his very own podcast, The Dale Jr Download on Dirty Mo Media. Earnhardt and co-host Mike Davis raise the bar with unparalleled perspective, candid commentary, and fascinating, first-person insight into the life of a broadcaster, celebrated racer.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd65f6b56d3ec8063af7e13ae",
      "appleId": "id603707723",
      "ratings": 7384,
      "velocity": 0
    }
  },
  {
    "title": "Dirty Mo Dough with Steve Letarte",
    "link": "7dBdGjqh7DMHQQ1Zo4Wn9u",
    "meta": {
      "rank": 10,
      "category": "Sports",
      "publisher": "Dirty Mo Media",
      "description": "Dirty Mo Dough is a fun, entertaining and informational podcast that explores sports betting through the exploits of Steve Letarte and his parlay pals, Chopper and The Professor. This band of bet-happy buddies analyzes odds, compiles statistics and uncovers hidden value on every aspect of NASCAR racing so that any level of gambler – from novice to expert – is informed and prepared to wager on the big race. Letarte’s passion for action, whether it be on the track or in the sportsbook, makes him the go-to resource for Dirty Mo Dough listeners.",
      "image": "https://i.scdn.co/image/ab67656300005f1fcef22874625dff7d0cb1fccc",
      "appleId": "id1669849442",
      "ratings": 17,
      "velocity": 0
    }
  },
  {
    "title": "The Old Man and the Three with JJ Redick and Tommy Alter",
    "link": "5vMLIaAcXeWUpXRpUt5qXY",
    "meta": {
      "rank": 11,
      "category": "Sports",
      "publisher": "ThreeFourTwo Productions | Wondery",
      "description": "Former NBA sharpshooter and Duke legend JJ Redick and his co-host Tommy Alter discuss the NBA, current events and interview some of the biggest names in the NBA, entertainment and political worlds. Launching from inside the NBA bubble, the show offers unprecedented access to the league while telling the stories of an eclectic rotating group of guests.",
      "image": "https://i.scdn.co/image/ab67656300005f1f306357ce2fc584666b0a0598",
      "appleId": "id1525281746",
      "ratings": 2633,
      "velocity": 0
    }
  },
  {
    "title": "Bear Grease",
    "link": "0MLEAslFa9CxTE3Gd5OX3E",
    "meta": {
      "rank": 12,
      "category": "Sports",
      "publisher": "MeatEater",
      "description": "The Bear Grease Podcast with host Clay Newcomb delivers compelling storytelling through documentary-style episodes exploring the culture, traditions, and history of rural America. He’ll dive in deep with hunters, biologists, anthropologists, and hillbillies to learn about human nature and our ancient connection to the land. Bear Grease explores unique people, topics, and stories that reveal the incredible value of life lived close to the land. Part of the MeatEater Podcast Network.",
      "image": "https://i.scdn.co/image/ab67656300005f1f4a161db5c80aa72ab2dabecc",
      "appleId": "id1559983625",
      "ratings": 5886,
      "velocity": 0
    }
  },
  {
    "title": "The MeatEater Podcast",
    "link": "4WkDOrAK3uASgK2PRF7j9M",
    "meta": {
      "rank": 13,
      "category": "Sports",
      "publisher": "MeatEater",
      "description": "Building on the belief that a deeper understanding of the natural world enriches all of our lives, host Steven Rinella brings an in-depth and relevant look at all outdoor topics including hunting, fishing, nature, conservation, and wild foods. Filled with humor, irreverence, and things that will surprise the hell out of you, each episode welcomes a diverse group of guests who add their own expertise to the vast world of the outdoors. Part of The MeatEater Podcast Network.",
      "image": "https://i.scdn.co/image/ab67656300005f1f99430953d576378660255d6e",
      "followers": 82344,
      "appleId": "id960902903",
      "ratings": 36160,
      "velocity": 1
    }
  },
  {
    "title": "Good Sport",
    "link": "1nZ77NESE2W6C1oGBgrqV1",
    "meta": {
      "rank": 14,
      "category": "Sports",
      "publisher": "TED",
      "description": "There's no better way to understand our world than through sports. Epic wins. Heartbreaking losses. The feeling you get when you look a teammate in the eye. Sports reveal the strange and fascinating psychology that competition brings out in all of us. Good Sport dives into worlds like F1 racing, table tennis, NBA shooting, and beyond. Asking questions like: Is \"the zone\" a real place? What are talent hotbeds, and how do we create them? And… is it still baseball if you're wearing a giant banana suit? From host Jody Avirgan (30 for 30, FiveThirtyEight, Radiotopia) and the TED Audio Collective, Good Sport is your guide through an array of stadiums, pitches, pools and slopes that shed a light on the ups and downs of being human.",
      "image": "https://i.scdn.co/image/ab67656300005f1fe4a1466f67b6a1086c828e06",
      "appleId": "id1665277775",
      "ratings": 17,
      "velocity": 4
    }
  },
  {
    "title": "The Ryen Russillo Podcast",
    "link": "2XdegS23ImVZldex799DUS",
    "meta": {
      "rank": 15,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "Each week, Ryen Russillo will break down the biggest topics in sports.",
      "image": "https://i.scdn.co/image/ab67656300005f1fe03baf25596eeb6151488e99",
      "followers": 551280,
      "appleId": "id1433966613",
      "ratings": 13047,
      "velocity": 1
    }
  },
  {
    "title": "The Lowe Post",
    "link": "2mZHt3zBxyIuc0PYLdDDkr",
    "meta": {
      "rank": 16,
      "category": "Sports",
      "publisher": "ESPN, Zach Lowe",
      "description": "ESPN's Zach Lowe talks to various basketball people about various basketball things.",
      "image": "https://i.scdn.co/image/ab67656300005f1fb6b5813ec29b6f0b8ae422d3",
      "appleId": "id986595124",
      "ratings": 7011,
      "velocity": -2
    }
  },
  {
    "title": "Skip and Shannon: Undisputed",
    "link": "7L0OIwF2hNrjauNq8vRCUP",
    "meta": {
      "rank": 17,
      "category": "Sports",
      "publisher": "FOX Sports",
      "description": "The Skip and Shannon: Undisputed Podcast. Skip Bayless, Shannon Sharpe, and Jen Hale discuss the biggest stories in the world of sports. It's unscripted and unfiltered. Don't miss the television show Monday-Friday at 9:30am ET on FS1.",
      "image": "https://i.scdn.co/image/ab67656300005f1f54a2d7c5f66d6b3da54cf30a",
      "followers": 3300288,
      "appleId": "id1150088852",
      "ratings": 6415,
      "velocity": 1
    }
  },
  {
    "title": "The Ringer NBA Show",
    "link": "5jUeKBONOmKJivqrRoIDJn",
    "meta": {
      "rank": 18,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "The Ringer NBA team provides insight, reporting, and analysis on the NBA five days a week. MON & THURS: 'Real Ones' with Logan Murdock & Raja Bell; TUES: 'The Answer' with Seerat Sohi & J. Kyle Mann; WED: 'Group Chat' with Justin Verrier, Rob Mahoney & Wosny Lambre; FRI: 'Weekends With Wos' with Wosny Lambre & 'Off Guard' with Austin Rivers & Pausha Haghighi.",
      "image": "https://i.scdn.co/image/ab67656300005f1f7a8d0d6a7d13ccba1ebe1505",
      "followers": 131681,
      "appleId": "id1109271715",
      "ratings": 8715,
      "velocity": -2
    }
  },
  {
    "title": "Go! My Favorite Sports Team",
    "link": "4Hn3qhWe5NqnhLFKytyfFW",
    "meta": {
      "rank": 19,
      "category": "Sports",
      "publisher": "Markiplier & Tyler Scheid | Wood Elf Media",
      "description": "Whether you’re glued to ESPN 24/7, or you don’t know the difference between a goal and a touchdown (points?!), this show will have something for everyone – sports megafans and novices alike. Mark Fischbach (Markiplier) and Tyler Scheid are the sports commentators you didn't know you needed on \"Go! My Favorite Sports Team.\"",
      "image": "https://i.scdn.co/image/ab67656300005f1fa3eedc558bbc37135844a7e3",
      "appleId": "id1607149283",
      "ratings": 2800,
      "velocity": 2
    }
  },
  {
    "title": "Door Bumper Clear",
    "link": "6EGctjYNHAj3fISB4aPQw0",
    "meta": {
      "rank": 20,
      "category": "Sports",
      "publisher": "Dirty Mo Media",
      "description": "Door Bumper Clear is in its seventh year of bringing unparalleled insight from the world of NASCAR to its rapidly expanding fan base. Hosted by veteran spotters Brett Griffin, T.J. Majors and Freddie Kraft, as well as industry insider Casey Boat, this podcast is an influential voice with a comedic, bold and transparent bent. Whether it’s recapping the previous race, reacting to rumors or engaging in debate, Door Bumper Clear is the go-to podcast for the edgy race fan.",
      "image": "https://i.scdn.co/image/ab67656300005f1f14cc25d82a778ef8d60cbdc4",
      "appleId": "id1084484313",
      "ratings": 2244,
      "velocity": -2
    }
  },
  {
    "title": "#thisleague UNCUT",
    "link": "2PI6qxCJLMITxqI4Ax5ntl",
    "meta": {
      "rank": 21,
      "category": "Sports",
      "publisher": "iHeartPodcasts",
      "description": "#thisleague UNCUT dishes on hot NBA topics beyond what Chris Haynes and Marc Stein report on social media with even more candor and opinion. Stein and Haynes go deep and dive into the all the NBA topics, rumblings, and intel!",
      "image": "https://i.scdn.co/image/ab67656300005f1f1164524b64c759cbf94834a2",
      "velocity": -7
    }
  },
  {
    "title": "Club Shay Shay",
    "link": "060hDdnydsJyMi17TmvyAh",
    "meta": {
      "rank": 22,
      "category": "Sports",
      "publisher": "FOX Sports",
      "description": "Each week Shannon Sharpe—3x Super Bowl champion, member of the Pro Football Hall of Fame and co-host of Undisputed on FS1—sits down with athletes, celebrities and influencers to break down, analyze and discuss the latest headlines in sports, pop culture and everything in-between. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f539df2eeedc9b98d1b62c3f8",
      "appleId": "id1531023690",
      "ratings": 3923,
      "velocity": -1
    }
  },
  {
    "title": "First Take",
    "link": "5LUnGGXpNoeaH1K0tWdLiB",
    "meta": {
      "rank": 23,
      "category": "Sports",
      "publisher": "ESPN, Stephen A. Smith, Molly Qerim Rose",
      "description": "First Take is always a heated discussion as Stephen A. Smith and guests debate about the day's top stories.",
      "image": "https://i.scdn.co/image/ab67656300005f1f5621bd25d5b3e61f14f62fa6",
      "appleId": "id428989929",
      "ratings": 4945,
      "velocity": 0
    }
  },
  {
    "title": "The Pat Bev Podcast with Rone",
    "link": "2pnagsbUIRHTy8Lf45mXgM",
    "meta": {
      "rank": 24,
      "category": "Sports",
      "publisher": "Barstool Sports",
      "description": "One of the NBA’s most outspoken stars, Pat Beverley, teams up with Rone to give you an unfiltered look into the Lakers locker room & everything happening across the league. Powered by Barstool Sports.You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit barstool.link/patbevpod",
      "image": "https://i.scdn.co/image/ab67656300005f1f49662ef248d7bf1b353fa528",
      "appleId": "id1649234927",
      "ratings": 500,
      "velocity": 0
    }
  },
  {
    "title": "All The Smoke",
    "link": "3Cdge5G5apw1LsC8jGcl4j",
    "meta": {
      "rank": 25,
      "category": "Sports",
      "publisher": "The Black Effect and iHeartPodcasts",
      "description": "ALL THE SMOKE pairs two of the most outspoken and controversial players of their time. Known as fiery, intense competitors during their on-court careers, Matt Barnes and Stephen Jackson are now two of the most widely respected voices by today’s crop of NBA stars. Serving as mentors to numerous players throughout the league and with their hands firmly on the pulse of the game, they have first-hand insight into the minds, lives and pressing issues facing today’s players. Barnes and Jackson, who have played alongside two generations of All-Stars, will dish on the latest news and drama from on and off the court without boundaries.",
      "image": "https://i.scdn.co/image/ab67656300005f1f2642ff2b7bf3bf6eb29e86ca",
      "appleId": "id1483638752",
      "ratings": 6869,
      "velocity": 0
    }
  },
  {
    "title": "The Dan Le Batard Show with Stugotz",
    "link": "2FuorRyd1NSURMWW9Ab7lj",
    "meta": {
      "rank": 26,
      "category": "Sports",
      "publisher": "Dan Le Batard, Stugotz",
      "description": "From their Oceanside studios at the Clevelander Hotel in Miami Beach, Dan Le Batard, Stugotz and company share their unique perspectives on all-things sports, pop-culture and more. This is the place for original content from Lebatard and Stu Gotz, including the daily “Local Hour” generally focusing on the South Florida scene, the Big Suey, and a few more surprises along the way.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6cca0eb7aa30151efe3412cb",
      "appleId": "id934820588",
      "ratings": 30429,
      "velocity": 0
    }
  },
  {
    "title": "Thanalysis",
    "link": "2DnXriTEVsqTRS7fyH8qby",
    "meta": {
      "rank": 27,
      "category": "Sports",
      "publisher": "Thanasis Antetokounmpo",
      "description": "Thanalysis, is a podcast hosted by Thanasis Antetokounmpo that aims to bring fun, motivational, education and honest conversation to the NBA podcast space. A weekly guest will join the NBA star in-studio to discuss their achievements, goals and what motivates them.  Watch every episode on the AntetokounBrosTv YouTube Channel: https://www.youtube.com/@AntetokounBrosTv",
      "image": "https://i.scdn.co/image/ab67656300005f1f963fcf3cacb9af7c01c90b9a",
      "appleId": "id1668922195",
      "ratings": 34,
      "velocity": 1
    }
  },
  {
    "title": "Spittin Chiclets",
    "link": "7IWzayPhHif6GhgtTQdB84",
    "meta": {
      "rank": 28,
      "category": "Sports",
      "publisher": "Barstool Sports",
      "description": "Former NHL vets Ryan Whitney, Paul Bissonnette, Barstool Sports writer Rear Admiral and Producer Mike Grinnell bring their outspoken and irreverent opinions to the masses. Focusing on the NHL but also touching on pop culture and everything else under the sun. New episode every Tuesday..You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit barstool.link/schiclets",
      "image": "https://i.scdn.co/image/bdc615e1ae144bea57783f9e46a3042d90447566",
      "appleId": "id1112425552",
      "ratings": 18595,
      "velocity": 0
    }
  },
  {
    "title": "Brian Windhorst & The Hoop Collective",
    "link": "4mOLvZqMud0JromeBgLpIh",
    "meta": {
      "rank": 29,
      "category": "Sports",
      "publisher": "ESPN, NBA, Brian Windhorst",
      "description": "Brian Windhorst and a team of ESPN's Insiders sort out life in and around the NBA world.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa6b2882e5970b14dad0bc5f4",
      "velocity": -2
    }
  },
  {
    "title": "The Herd with Colin Cowherd",
    "link": "7rq03nfUFD5KrpiBQ9fals",
    "meta": {
      "rank": 30,
      "category": "Sports",
      "publisher": "iHeartPodcasts and The Volume",
      "description": "The Herd with Colin Cowherd is a thought-provoking, opinionated, and topic-driven journey through the top sports stories of the day.",
      "image": "https://i.scdn.co/image/ab67656300005f1f766c260c1478b6bf0d9eaa35",
      "velocity": 1
    }
  },
  {
    "title": "Through the Wire",
    "link": "2xyBo5E26Ixjysv75wqkkJ",
    "meta": {
      "rank": 31,
      "category": "Sports",
      "publisher": "Bleacher Report",
      "description": "House of Highlights brings you the ultimate NBA fan podcast, hosted by four childhood friends talking all things NBA both on and off the court. Whether you're a casual fan or live and die for basketball, you won't want to miss Kenny, Pierre, Mike and Darrick bringing their hot takes to the mic, two times a week.",
      "image": "https://i.scdn.co/image/7d5ce4413d84bcde983788f02dac0dabc94dbc7b",
      "appleId": "id1278687237",
      "ratings": 7066,
      "velocity": -1
    }
  },
  {
    "title": "Fore Play",
    "link": "0F7S8Jv6RsQXm5QrD4aZUX",
    "meta": {
      "rank": 32,
      "category": "Sports",
      "publisher": "Barstool Sports",
      "description": "\"Fore Play\" is a weekly podcast by common golfers, for common golfers. Trent, Riggs, Frankie, Dan Rapaport, and their wide variety of guests talk about everything golf like normal folks sitting at a bar watching coverage, venting about the game's difficulties, and weighing in on pro gossip. Your classic golf addicts, the \"Fore Play\" crew brings a young, unique voice to the rapidly-evolving game, discussing freely and openly everything golf. There is nothing like it.You can find every episode of this show on Apple Podcasts, Spotify or YouTube. Prime Members can listen ad-free on Amazon Music. For more, visit barstool.link/foreplaypod",
      "image": "https://i.scdn.co/image/ab67656300005f1f88621da03d22082760e11796",
      "appleId": "id1200343264",
      "ratings": 10037,
      "velocity": -1
    }
  },
  {
    "title": "The Mismatch",
    "link": "17GacVP62XZmK5FuOLUpd1",
    "meta": {
      "rank": 33,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "Kevin O’Connor and Chris Vernon discuss all the news, trends, and transactions happening in the NBA. They also offer their on-court analysis, and occasionally get into heated debates.",
      "image": "https://i.scdn.co/image/ab67656300005f1fff9a7a447ba004dc5764f8d1",
      "appleId": "id1317853625",
      "ratings": 4983,
      "velocity": 0
    }
  },
  {
    "title": "The Draymond Green Show",
    "link": "4uEA3lPBibUlrPOciIMCRY",
    "meta": {
      "rank": 34,
      "category": "Sports",
      "publisher": "iHeartPodcasts and The Volume",
      "description": "4-time NBA champion Draymond Green sounds off on the NBA and goes 1-on-1 with some of the biggest names in basketball",
      "image": "https://i.scdn.co/image/ab67656300005f1feebac57e0e4734a47d2d9394",
      "appleId": "id1595716948",
      "ratings": 1397,
      "velocity": 1
    }
  },
  {
    "title": "The Late Kick with Josh Pate",
    "link": "553DKKHsBSCOkrZdppJpeB",
    "meta": {
      "rank": 35,
      "category": "Sports",
      "publisher": "Arch Manning, 247Sports, College Football",
      "description": "The Late Kick with Josh Pate delivers College football the way you want it. Behind-the-scenes whispers and intel thanks to a network of team insiders. Game breakdowns and rapid reaction along with the occasional gambling and recruiting twist. No offseason, no low-hanging fruit, no hot take — just the information you need to know on a show built with YOU in mind.",
      "image": "https://i.scdn.co/image/ab67656300005f1fe2c6adc37ca4ad842d2912f9",
      "appleId": "id1485905502",
      "ratings": 2570,
      "velocity": -1
    }
  },
  {
    "title": "No Laying Up - Golf Podcast",
    "link": "3s3ihp9OHKAMuc46RitVPj",
    "meta": {
      "rank": 36,
      "category": "Sports",
      "publisher": "NoLayingUp.com",
      "description": "Fresh, funny discussions about the world of golf from the guys at www.nolayingup.com",
      "image": "https://i.scdn.co/image/ab67656300005f1fe83394394fd934bf4c4b95b3",
      "appleId": "id880837011",
      "ratings": 5815,
      "velocity": 1
    }
  },
  {
    "title": "Talkin' Baseball (MLB Podcast)",
    "link": "09USaYF2LTQpNwBXnFGbAT",
    "meta": {
      "rank": 37,
      "category": "Sports",
      "publisher": "Jomboy Media",
      "description": "Every Monday and Friday we will be breaking down and recapping the series that were, the standings, the good, the bad and the angry from MLB.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa90a6315ef15e94d833fde2e",
      "appleId": "id1472939543",
      "ratings": 2693,
      "velocity": 4
    }
  },
  {
    "title": "Nobody Asked Us with Des & Kara",
    "link": "68gjR5AX6S81rZCqCgYhCc",
    "meta": {
      "rank": 38,
      "category": "Sports",
      "publisher": "Des Linden and Kara Goucher",
      "description": "Once competitors and Olympic teammates, now friends and podcast partners, Des Linden and Kara Goucher share their hot takes about all things running with a little bit of life-stuff sprinkled in too. Come for the insights on running and stay for the inspiration from two legends in the sport. No filter needed.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9e11202954e4b9a52bed050f",
      "appleId": "id1664629953",
      "ratings": 518,
      "velocity": -3
    }
  },
  {
    "title": "Tour Life with Brodie Smith and Paul Ulibarri",
    "link": "24Njsr7puAiQxjSSXFMYwM",
    "meta": {
      "rank": 39,
      "category": "Sports",
      "publisher": "Foundation Disc Golf",
      "description": "Touring disc golf pros Brodie Smith and Paul Ulibarri discuss the current and future state of professional disc golf! Every week catch Brodie and Paul as they go over their current DGPT season and talk about the trending topics in disc golf. Watch and listen to new episodes every Tuesday night live on Youtube at 8PM EST.",
      "image": "https://i.scdn.co/image/ab67656300005f1f49a0936e565066edb64cb306",
      "appleId": "id1666597105",
      "ratings": 28,
      "velocity": 4
    }
  },
  {
    "title": "The Ripple Effect with James Lawrence Allcott",
    "link": "3oxaX20iph21oA25UrQLGb",
    "meta": {
      "rank": 40,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "Football pundit James Lawrence Allcott looks at the immediate, long-term, and off-the-wall consequences of the biggest stories in the sport, from today and yesterday.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6032d3db44147470ca1a6b6e",
      "appleId": "id1670185595",
      "ratings": 4,
      "velocity": 2
    }
  },
  {
    "title": "Full Swing Thoughts",
    "link": "52ZpQZmOPyoawDbY2v6trW",
    "meta": {
      "rank": 41,
      "category": "Sports",
      "publisher": "The Fried Egg",
      "description": "Full Swing Thoughts is a podcast from The Fried Egg on the Netflix golf docuseries, Full Swing. Andy Johnson, Joseph LaMagna, and Brendan Porath will recap and review each episode in this feed, sharing insights on what they learned about the tours and their stars, what they found amusing, what worked, and what flopped. They will attempt to bring their usual enthusiasm, skepticism, and humor as they discuss the unveiling of this highly anticipated new show.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd7705d6a647f612e4f99a640",
      "appleId": "id1670228339",
      "ratings": 25,
      "velocity": 8
    }
  },
  {
    "title": "Pivot Podcast",
    "link": "5KtXTWiC3J5WW1CVTpYG5V",
    "meta": {
      "rank": 42,
      "category": "Sports",
      "publisher": "Shots Podcast Network",
      "description": "Pivot Podcast brought to you by Happy Dad Hard Seltzer.",
      "image": "https://i.scdn.co/image/ab67656300005f1fabbe0f6d7e7ab5186eec8718",
      "appleId": "id1073226719",
      "ratings": 5089,
      "velocity": -4
    }
  },
  {
    "title": "The Dan Patrick Show",
    "link": "1X2isRkjbJAPr8BSjJKiYf",
    "meta": {
      "rank": 43,
      "category": "Sports",
      "publisher": "iHeartPodcasts and Dan Patrick Podcast Network",
      "description": "Listen to Dan's daily radio show. With exclusive insider access, Patrick brings A-list guests from the world of sports and entertainment to the show. Sharing his perspective on pop culture and sports, Patrick also brings a dose of humor to his fans.",
      "image": "https://i.scdn.co/image/ab67656300005f1f5343365e5df2bf90458dbede",
      "appleId": "id279241099",
      "ratings": 7525,
      "velocity": -3
    }
  },
  {
    "title": "The Ringer's Philly Special",
    "link": "6WbmndIH0l5zUVQxWwuOlz",
    "meta": {
      "rank": 44,
      "category": "Sports",
      "publisher": "The Ringer",
      "description": "The Ringer Philly crew has a podcast! Sheil Kapadia and Ben Solak team up on Sundays and Thursdays for weekly previews and instant reactions to every Eagles game. Plus we’ve got you covered on the Sixers and all of your other favorite teams in town, with unique conversations from local and Ringer personalities.",
      "image": "https://i.scdn.co/image/ab67656300005f1fcb50eef5a9e47031f612f9aa",
      "appleId": "id1643035796",
      "ratings": 313,
      "velocity": 4
    }
  },
  {
    "title": "The Double Bogey Show",
    "link": "3XzQG4nd5h9yX3HdvM43L8",
    "meta": {
      "rank": 45,
      "category": "Sports",
      "publisher": "You Betcha",
      "description": "A podcast for below average golfers, hosted by below average golfers. The official podcast of the Breakfast Ball page.  Sub-brand of You Betcha.",
      "image": "https://i.scdn.co/image/ab67656300005f1f0a8d5cac0c9fe81fd357922a",
      "appleId": "id1538037906",
      "ratings": 215,
      "velocity": 4
    }
  },
  {
    "title": "Men In Blazers",
    "link": "2YiLKNHIBty5xVbBKLyjkD",
    "meta": {
      "rank": 46,
      "category": "Sports",
      "publisher": "Men In Blazers | Wondery",
      "description": "We discuss football. And wear blazers. Usually at the same time. Men in Blazers is driven by the belief that Soccer is America’s Sport of the Future. As it has been since 1972.",
      "image": "https://i.scdn.co/image/ab67656300005f1f1eb422f95c7aa36264e4330b",
      "appleId": "id908407811",
      "ratings": 4908,
      "velocity": -6
    }
  },
  {
    "title": "The Athletic NBA Show",
    "link": "7hVMyKCBLJ6uqIKcvKuz88",
    "meta": {
      "rank": 47,
      "category": "Sports",
      "publisher": "The Athletic",
      "description": "An NBA podcast featuring a rotating lineup of the best insiders, writers, and reporters from The Athletic. Monday thru Saturday. Monday: Basketball Buds with Zach Harper and Friends | Tuesday: Tampering with Sam Amick, Anthony Slater and Fred Katz | Wednesday: Hoops Adjacent with David Aldridge and Marcus Thompson | Thursday: Point of Contention with Zach Harper, Marcus Thompson and Special Guests | Friday: Nerder She Wrote with Dave DuFour, Seth Partnow, and Mo Dakhil | And the Saturday Slam & Jam with Andrew Schlecht and Alex Speers. Plus, The NBA Daily Ding, a quick recap of the previous night's action.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc71b976fb7729be5cce805a5",
      "appleId": "id1358187061",
      "ratings": 1615,
      "velocity": -5
    }
  },
  {
    "title": "The Fighter & The Kid",
    "link": "1rAJCa0oxSuSKoTYOZJq26",
    "meta": {
      "rank": 48,
      "category": "Sports",
      "publisher": "Thiccc Boy Studios",
      "description": "The Fighter & The Kid is a weekly podcast hosted by comedian and former professional UFC fighter Brendan Schaub. Each week, Brendan is joined in the studio with a guest co host. TFATK is uncut and unedited, and sometimes it's just ridiculous.    ",
      "image": "https://i.scdn.co/image/ab67656300005f1fbdce32c6d82d15cf0b232718",
      "velocity": -3
    }
  },
  {
    "title": "ESPN Daily",
    "link": "3O3sl79wUkXBvf4DVjcYq6",
    "meta": {
      "rank": 49,
      "category": "Sports",
      "publisher": "ESPN, Pablo Torre",
      "description": "Wake up to the best sports story you'll hear all day. Monday through Friday, host Pablo Torre brings you an inside look at the most interesting stories at ESPN, as told by the top reporters and insiders on the planet. The breaking news of SportsCenter. The deep dive storytelling of 30 for 30. Get the very best of ESPN. Daily.",
      "image": "https://i.scdn.co/image/ab67656300005f1f395cebe30e4ae9de6df20367",
      "appleId": "id1482680261",
      "ratings": 3640,
      "velocity": 1
    }
  },
  {
    "title": "The Mina Kimes Show featuring Lenny",
    "link": "6iF7cYu0JmmHns3t8dKz93",
    "meta": {
      "rank": 50,
      "category": "Sports",
      "publisher": "ESPN, Omaha Productions, Mina Kimes",
      "description": "Mina talks all things football with her unique brand of humor and insight. Her friends join each episode to talk about the NFL's latest storylines along with her football loving dog, Lenny, making frequent contributions.",
      "image": "https://i.scdn.co/image/ab67656300005f1ff3ba75d43b9963e01ee4e383",
      "appleId": "id1437647915",
      "ratings": 6020,
      "velocity": 0
    }
  }
]