[
  {
    "title": "LPN Deep Dives: A Court of Thorns and Roses",
    "link": "0A3IirSc3Qi2MSFJcz2unj",
    "meta": {
      "rank": 1,
      "category": "Arts",
      "publisher": "The Last Podcast Network",
      "description": "Last Podcast Network presents LPN Deep Dives:  Season 2 - A Court of Thorns and Roses LPN's Deep Dives makes it's much anticipated return with a brand new series!  Join Natalie Jean (Some Place Under Neath) and Jackie Zebrowski (Page 7) as they titilate your earholes with their comprehensive \"deep dive\" style breakdowns of the popular adult fantasy novel series by Sarah J. Maas - A Court of Thorns and Roses.  -  Season 1 - Dune A 13-part journey down the sandy wormhole of Frank Herbert’s beloved Sci-Fi Masterpiece, Dune (and it’s subsequent sequels). Navigated by the one and only God Emperor himself Henry Zebrowski (Last Podcast on The Left, Adult Swim) and his enigmatic spice fueled co-host Holden McNeely (Wizard and The Bruiser).",
      "image": "https://i.scdn.co/image/ab67656300005f1fa9658c108dd9cb4796d9fb2a",
      "velocity": 0
    }
  },
  {
    "title": "The Magnus Archives",
    "link": "5pwBAjuJJAOt7cED5Lkjnk",
    "meta": {
      "rank": 2,
      "category": "Arts",
      "publisher": "Rusty Quill",
      "description": "“Make your statement, face your fear.” A weekly horror fiction podcast examining what lurks in the archives of the Magnus Institute, an organisation dedicated to researching the esoteric and the weird. Join Jonathan Sims as he explores the archive, but be be warned, as he looks into its depths something starts to look back… New episodes every Thursday produced by Rusty Quill, featuring guest actors, short stories, serial plots and more. The Magnus Archives 2 is live on Kickstarter right now you can pledge at the following link - https://www.kickstarter.com/projects/the-magnus-archives2/the-magnus-archives-2/ Get bonus content on Patreon Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9293c043dd656fbd79033f88",
      "appleId": "id1095138637",
      "ratings": 8300,
      "velocity": 0
    }
  },
  {
    "title": "Dan Carlin's Hardcore History",
    "link": "72qiPaoDRf8HkGKEChvG5q",
    "meta": {
      "rank": 3,
      "category": "Arts",
      "publisher": "Dan Carlin",
      "description": "In \"Hardcore History\" the very unconventional Dan Carlin takes his \"Martian\", outside-the-box way of thinking and applies it to the past. Was Alexander the Great as bad a person as Adolf Hitler? What would Apaches with modern weapons be like? Will our modern civilization ever fall like civilizations from past eras? This is a difficult-to-classify show that has a rather sharp edge.",
      "image": "https://i.scdn.co/image/b6c1e2056fdc51a501ec168ea68a3d76e7fca3f6",
      "followers": 433158,
      "appleId": "id173001861",
      "ratings": 59318,
      "velocity": -2
    }
  },
  {
    "title": "We Said What We Said With Rickey and Denzel",
    "link": "3TY4pXn8BgFa3Lfdt7b1pJ",
    "meta": {
      "rank": 4,
      "category": "Arts",
      "publisher": "Spotify Studios",
      "description": "Every week, join longtime besties Rickey Thompson and Denzel Dion as they dish on EVERYTHING THAT MATTERS. Pop culture! Sex! Partying! Struggle! Love! Music! Friendship! We Said What We Said is a show with bold advice, hot takes, and risqué storytelling.",
      "image": "https://i.scdn.co/image/ab67656300005f1f553d7d8ef0eba8cad487258e",
      "velocity": -1
    }
  },
  {
    "title": "Harry Potter Audiobooks",
    "link": "0kDkLNd4V6kEXseN9nP7s5",
    "meta": {
      "rank": 5,
      "category": "Arts",
      "publisher": "Talent Unlimited",
      "description": "Harry Potter Audiobooks! Ready by Stephen Fry.",
      "image": "https://i.scdn.co/image/ab67656300005f1fcd46dca0a6b5b91a2c8a1313",
      "appleId": "id1515800466",
      "ratings": 164,
      "velocity": 1
    }
  },
  {
    "title": "Gibi ASMR ",
    "link": "6MWAkIEDqe8cgQjPvUaW2V",
    "meta": {
      "rank": 6,
      "category": "Arts",
      "publisher": "Gibi ASMR",
      "description": "Gibi ASMR delivers creative, calming content meant to soothe the mind and allow you to drift off to dreamland. ASMR is suitable for relaxing, background audio, sleeping, or satisfying entertainment!",
      "image": "https://i.scdn.co/image/ab67656300005f1ff2a59194330656994ab9f516",
      "followers": 176342,
      "velocity": -2
    }
  },
  {
    "title": "The Moth",
    "link": "5UKrcYdaGbq10z97yqi81N",
    "meta": {
      "rank": 7,
      "category": "Arts",
      "publisher": "The Moth",
      "description": "Since its launch in 1997, The Moth has presented thousands of true stories, told live and without notes, to standing-room-only crowds worldwide. Moth storytellers stand alone, under a spotlight, with only a microphone and a roomful of strangers. The storyteller and the audience embark on a high-wire act of shared experience which is both terrifying and exhilarating. Since 2008, The Moth podcast has featured many of our favorite stories told live on Moth stages around the country. For information on all of our programs and live events, visit themoth.org.",
      "image": "https://i.scdn.co/image/ab67656300005f1ffcccbf35f3cb497ca660b87d",
      "followers": 96116,
      "appleId": "id275699983",
      "ratings": 23154,
      "velocity": -2
    }
  },
  {
    "title": "Vtuber Streams/ASMR",
    "link": "1hKJB08OCL3e3iNF9A8onZ",
    "meta": {
      "rank": 8,
      "category": "Arts",
      "publisher": "miley",
      "description": "like the title says it'll be vtuber stream audio and also boyfriend asmrs and yes,,, there are some spicy ones requests are open! send requests to renchan47@yahoo.com",
      "image": "https://i.scdn.co/image/ab67656300005f1f2b2fc826c563905a09f3411f",
      "velocity": 5
    }
  },
  {
    "title": "Let's Talk About Myths, Baby! Greek & Roman Mythology Retold",
    "link": "6S9jAhlyZtr5dj2tqYXeJ6",
    "meta": {
      "rank": 9,
      "category": "Arts",
      "publisher": "Liv Albert",
      "description": "The most entertaining and enraging stories from mythology told casually, contemporarily, and (let's be honest) sarcastically. Greek and Roman gods did some pretty weird (and awful) things. Liv focuses on Greek and Roman mythology's (mis)treatment of women, the wild things the gods did, and the all around incredible minds of the ancient world. Gods, goddesses, heroes, monsters, and everything in between. Regular episodes every Tuesday, conversations with authors and scholars or readings of ancient epics every Friday.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9451631e8bf739a4a8f104f7",
      "velocity": -1
    }
  },
  {
    "title": "99% Invisible",
    "link": "2VRS1IJCTn2Nlkg33ZVfkM",
    "meta": {
      "rank": 10,
      "category": "Arts",
      "publisher": "Roman Mars",
      "description": "Design is everywhere in our lives, perhaps most importantly in the places where we've just stopped noticing. 99% Invisible is a weekly exploration of the process and power of design and architecture. From award winning producer Roman Mars. Learn more at 99percentinvisible.org.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc2ce8ec0c4fe39ce48a02f73",
      "appleId": "id394775318",
      "ratings": 23976,
      "velocity": -1
    }
  },
  {
    "title": "Fresh Air",
    "link": "0HF5T1BVjaUR6dMlAamdB5",
    "meta": {
      "rank": 11,
      "category": "Arts",
      "publisher": "NPR",
      "description": "Fresh Air from WHYY, the Peabody Award-winning weekday magazine of contemporary arts and issues, is one of public radio's most popular programs. Hosted by Terry Gross, the show features intimate conversations with today's biggest luminaries.Subscribe to Fresh Air Plus! You'll be supporting the unique show you can't get enough of - and you can listen sponsor-free. Learn more at plus.npr.org/freshair",
      "image": "https://i.scdn.co/image/ab67656300005f1fea06f985a2f57dae1fee5239",
      "followers": 275966,
      "appleId": "id214089682",
      "ratings": 31085,
      "velocity": -1
    }
  },
  {
    "title": "(n)sfw audios",
    "link": "67ZiO9obVC0cBNNHYfsp6E",
    "meta": {
      "rank": 12,
      "category": "Arts",
      "publisher": "val",
      "description": "listen at your own discretion",
      "image": "https://i.scdn.co/image/ab67656300005f1f8b64b0b24e6d557caf16797a",
      "velocity": -1
    }
  },
  {
    "title": "Something Scary",
    "link": "3IhUqegzY0g0PJJPaoQdYS",
    "meta": {
      "rank": 13,
      "category": "Arts",
      "publisher": "Studio71",
      "description": "Do you wanna hear something scary? Join Blair and Steffany every week as they bring you the creepiest ghost stories, urban legends, and folktales. Wanna hear something scary without ads? Click here: https://somethingscary.supercast.tech/ We wanna make the podcast even better, help us learn how we can: https://bit.ly/2EcYbu4  For advertising opportunities please email PodcastPartnerships@Studio71us.com    Privacy Policy: https://www.studio71.com/us/terms-and-conditions-use/#Privacy%20Policy",
      "image": "https://i.scdn.co/image/ab67656300005f1fa93a411d1136a463d16a1f38",
      "followers": 5224,
      "appleId": "id1438162222",
      "ratings": 7928,
      "velocity": 1
    }
  },
  {
    "title": "Solitaire",
    "link": "5IItvGtrO3c1BwUCamHGXF",
    "meta": {
      "rank": 14,
      "category": "Arts",
      "publisher": "Rololory",
      "description": "In Solitaire, Alice Oseman has brought to life a vivid, clever, and heartfelt portrayal of what it's like to be a teenager today. This stunning debut novel-which the Times (London) called \"The Catcher in the Rye for the digital age\"-is perfect for fans of Melina Marchetta, Stephen Chbosky, and Rainbow Rowell.",
      "image": "https://i.scdn.co/image/ab67656300005f1f6c671666f464b8f0d3c90406",
      "velocity": 2
    }
  },
  {
    "title": "The Jimmy Dore Show",
    "link": "35UZkmSndjvs1zdH2zACFT",
    "meta": {
      "rank": 15,
      "category": "Arts",
      "publisher": "Jimmy Dore",
      "description": "“ Jimmy Dore is outrageous and outraged, bothersome and bothered, a crucial, profane, passionate voice for progressives and freethinkers in 21st century America.” -Patton Oswalt",
      "image": "https://i.scdn.co/image/e90e0e2475be4d71a6048584155cbcf4996171a1",
      "followers": 437664,
      "appleId": "id390071758",
      "ratings": 3261,
      "velocity": -8
    }
  },
  {
    "title": "Eaten Rotten Apples",
    "link": "4rStqMUO3Wj3PDspxwKad5",
    "meta": {
      "rank": 16,
      "category": "Arts",
      "publisher": "Danielle & Thyri",
      "description": "A mother daughter duo who discuss uncomfortable topics, some of which are requested by listeners. By utilizing their different backgrounds in dealing with the world, Danielle and Thyri give insight based on their own experiences.Sometimes sad, often funny, but always honest. You will be gripping the edge of your seat when you hear just how different this mother and daughters perspective can be.",
      "image": "https://i.scdn.co/image/ab67656300005f1fa10d29077e934d9ea6e51775",
      "appleId": "id1671372896",
      "ratings": 302,
      "velocity": 0
    }
  },
  {
    "title": "Poetry Unbound",
    "link": "5gS9llUxTSORzMZtbDK4xh",
    "meta": {
      "rank": 17,
      "category": "Arts",
      "publisher": "On Being Studios",
      "description": "Your poetry ritual: An immersive reading of a single poem, guided by Pádraig Ó Tuama. Unhurried, contemplative and energizing. New episodes on Monday and Friday, about 15 minutes each. Two seasons per year, with occasional special offerings. Anchor your life with poetry.",
      "image": "https://i.scdn.co/image/2e445508aeb0a5cbf5d03e1ffac0921e96e41473",
      "appleId": "id1492928827",
      "ratings": 2991,
      "velocity": 16
    }
  },
  {
    "title": "Articles of Interest",
    "link": "6XKe8xy5P16OLrkBW9oz0k",
    "meta": {
      "rank": 18,
      "category": "Arts",
      "publisher": "Avery Trufelman",
      "description": "Articles of Interest is a show about what we wear.  Produced and Hosted by Avery Trufelman",
      "image": "https://i.scdn.co/image/ab67656300005f1fa7207f0495770d31024d9dc7",
      "appleId": "id1455169228",
      "ratings": 2577,
      "velocity": -6
    }
  },
  {
    "title": "LeVar Burton Reads",
    "link": "21yjAjzYXD1xCNDad4OdTV",
    "meta": {
      "rank": 19,
      "category": "Arts",
      "publisher": "LeVar Burton and Stitcher",
      "description": "The best short fiction, handpicked by the best voice in podcasting. In every episode, host LeVar Burton (Roots, Reading Rainbow, Star Trek) invites you to take a break from your daily life, and dive into a great story. LeVar’s narration blends with gorgeous soundscapes to bring stories by Neil Gaiman, Haruki Murakami, Octavia Butler, Ray Bradbury and more to life. So, if you’re ready, let’s take a deep breath...",
      "image": "https://i.scdn.co/image/ab67656300005f1fff731352c8ef5aca71ed987f",
      "followers": 2191503,
      "appleId": "id1244649384",
      "ratings": 15703,
      "velocity": -4
    }
  },
  {
    "title": "Myths and Legends",
    "link": "6xqETOvGnSQHH0xdLtgcXU",
    "meta": {
      "rank": 20,
      "category": "Arts",
      "publisher": "Jason Weiser, Carissa Weiser, Nextpod",
      "description": "Jason Weiser and Carissa Weiser tell stories from myths, legends, and folklore that have shaped cultures throughout history. Some, like the stories of Aladdin, King Arthur, and Hercules are stories you think you know, but with surprising origins. Others are stories you might not have heard, but really should. All the stories are sourced from world folklore, but retold for modern ears. These are stories of wizards, knights, Vikings, dragons, princesses, and kings from the time when the world beyond the map was a dangerous and wonderful place.",
      "image": "https://i.scdn.co/image/ab67656300005f1fc9328b1662268e9872ba7398",
      "followers": 30,
      "appleId": "id990897842",
      "ratings": 22352,
      "velocity": -3
    }
  },
  {
    "title": "The Great Gatsby ",
    "link": "341R324vMqkInpnAskxw6Q",
    "meta": {
      "rank": 21,
      "category": "Arts",
      "publisher": "F. Scott Fitzgerald ",
      "description": "When F. Scott Fitzgerald published The Great Gatsby in 1925, the novel was not an instant hit – but you wouldn’t know it now, given its standing in school curricula and pop culture alike. The novel is a classic, following the exploits of its narrator, Nick Carroway, as he enters the glittering world of New York’s elite. A world filled with boozy parties, romantic obsessions, and a mysterious millionaire named Jay. Now, the classic novel is an immersive audiobook. Enjoy this production of The Great Gatsby, produced by Scott Sherratt and narrated by Scott Shepherd. ",
      "image": "https://i.scdn.co/image/ab67656300005f1f74f98385586afc0af5a5ad02",
      "appleId": "id1580135175",
      "ratings": 22,
      "velocity": -1
    }
  },
  {
    "title": "Psychedelic",
    "link": "6S4F8kmX0PGdCIQRjiLgl9",
    "meta": {
      "rank": 22,
      "category": "Arts",
      "publisher": "Sabrina Borja",
      "description": "Understanding the human mind and opening yours thru psychedelic episodes. Support this podcast: https://anchor.fm/sabrina-borja/support",
      "image": "https://i.scdn.co/image/8e96793ce84e9de10021a67e86a08ec24cbec3d7",
      "velocity": 7
    }
  },
  {
    "title": "Classical Stuff You Should Know",
    "link": "3yGv8BAJO4FubexBobLskk",
    "meta": {
      "rank": 23,
      "category": "Arts",
      "publisher": "A.J. Hanenburg, Graeme Donaldson, and Thomas Magbee",
      "description": "A.J., Graeme, and Thomas discuss everything having to do with the classical world. Our aim is to help both educators and laypeople enjoy the classical world as much as they enjoy fine ales and good tales.",
      "image": "https://i.scdn.co/image/ab67656300005f1f219e0509874a4eaa076369b3",
      "appleId": "id1305381419",
      "ratings": 487,
      "velocity": -5
    }
  },
  {
    "title": "Dee’s Big Nuts",
    "link": "3CNdcWMsY8HyjsrASH6yGw",
    "meta": {
      "rank": 24,
      "category": "Arts",
      "publisher": "jisunhi",
      "description": "listen to dees big nuts and play with dees nuts",
      "image": "https://i.scdn.co/image/ab67656300005f1ff9fb35d65f8ca73a88be621a",
      "velocity": -2
    }
  },
  {
    "title": "Marvel’s Wolverine: The Lost Trail",
    "link": "5CQRg19tjlz3V9mtjJstDF",
    "meta": {
      "rank": 25,
      "category": "Arts",
      "publisher": "Marvel & SiriusXM",
      "description": "Marvel’s “Wolverine: The Lost Trail” is an epic quest that takes place in the Louisiana bayou. Following the events of Marvel’s “Wolverine: The Long Night,” Logan (Richard Armitage) returns to New Orleans in search of redemption, only to discover that his ex-lover, Maureen is nowhere to be found. And she's not the only one. Dozens of humans and mutants have gone missing, including the mother of a teenage boy, Marcus Baptiste. With Weapon X in close pursuit, Logan and Marcus must team up and follow a trail of clues that leads them deep into the gothic heart of the bayou, where they encounter biker gangs, Cajun thieves and a world of wonders that defies explanation.  It is here that they find Greenhaven -- a refuge run by a powerful mutant named Jason Wyngarde.  Award-winning comic book author Ben Percy (“The Dark Net,” “Red Moon”), director/sound designer Brendan Baker (“Wolverine: The Long Night”) and associate director/sound designer Chloe Prasinos (“Wolverine: The Long Night”) return for the series.  Season 1, \"Wolverine: The Long Night\" is also available to listen!",
      "image": "https://i.scdn.co/image/ab67656300005f1f6b256e9e8a4062ca56125231",
      "appleId": "id1343499710",
      "ratings": 7697,
      "velocity": -6
    }
  },
  {
    "title": "The Free Audiobooks",
    "link": "6R76Hw6GPIX8AnFXE9UtWf",
    "meta": {
      "rank": 26,
      "category": "Arts",
      "publisher": "The Free Audiobooks",
      "description": "'The Free Audiobooks' brings you a whole new collection of informative, useful, entertaining, and knowledgeable Audiobooks.",
      "image": "https://i.scdn.co/image/ab67656300005f1f073134b1ddf4a218fa64c231",
      "velocity": 0
    }
  },
  {
    "title": "Gals on the Go",
    "link": "2bcsDo6LNfx6orsEtwoE7r",
    "meta": {
      "rank": 27,
      "category": "Arts",
      "publisher": "PodcastOne",
      "description": "Gals on the Go is a lifestyle podcast hosted by influencers and YouTubers Danielle Carolan and Brooke Miccio. Starting in 2018, this weekly podcast highlights conversations about friendship, navigating your 20’s + early adulthood, social media trends, relationships, family and so much more. Gals on the Go focuses on having real, raw, and honest conversations in an effort to “pull back the curtain” on what may look like perfect and glamorous lives on social media. STAY TUNED FOR NEW EPISODES EVERY WEDNESDAY!   For Business Inquiries, contact GalsOnTheGoPodcastTeam@unitedtalent.com ",
      "image": "https://i.scdn.co/image/ab67656300005f1f6b3469bca6a1af3d6277f7f2",
      "appleId": "id1415808510",
      "ratings": 8692,
      "velocity": -2
    }
  },
  {
    "title": "Gorillaz presents: The Stuart Potcast",
    "link": "4jWsa4ONqaBKhOwhKUt1jG",
    "meta": {
      "rank": 28,
      "category": "Arts",
      "publisher": "Gorillaz",
      "description": "2D from Gorillaz – aka Stuart Pot – has been given a Dictaphone to record his day-to-day adventures in Silver Lake. He calls it a podcast, but that’s a bit of stretch... Introducing the Stuart PotCast. Hosted on Acast. See acast.com/privacy for more information.",
      "image": "https://i.scdn.co/image/ab67656300005f1ff0e47e50afbbf263c93b0bfd",
      "velocity": -5
    }
  },
  {
    "title": "TGCF ",
    "link": "3q4AAnDTkGtqHmi4B7JnHZ",
    "meta": {
      "rank": 29,
      "category": "Arts",
      "publisher": "Yushi Huang",
      "description": "Translation by YummySuika (unofficial). Audiobook by Crimsonrain on youtube.",
      "image": "https://i.scdn.co/image/ab67656300005f1f00ec7be69b0c6fb03bc6a93f",
      "velocity": 0
    }
  },
  {
    "title": "Grown, a podcast from The Moth",
    "link": "40OlGGRHNZU9UB9AMYhORT",
    "meta": {
      "rank": 30,
      "category": "Arts",
      "publisher": "Grown",
      "description": "Grown is a podcast about the in-between: the nebulous, the liminal, the just plain weird time between those awkward teenage years and full-on adulthood. Grown is co-hosted by Aleeza Kazmi and Alfonso “Fonzo” Lacayo, two Moth storytellers and graduates of The Moth’s Education program who are on the cusp of adulthood themselves. Together, they guide listeners through true stories that deal with the challenges and joys of growing up. Using their unique points of view, Aleeza and Fonzo will discuss first crushes, culture, identity, secrets, and more.   Like The Moth Podcast, Grown centers these fresh, personal stories told at Moth events worldwide—but Grown also features conversations with the storytellers themselves, on the street interviews, audio diaries from young voices, and more. Grown is a podcast that reminds us that no matter how old we are, we’re never fully grown.   New episodes drop bi-weekly on Wednesdays beginning on February 8, 2023.",
      "image": "https://i.scdn.co/image/ab67656300005f1ff1723b98e7c380f780fea296",
      "appleId": "id1664856279",
      "ratings": 34,
      "velocity": 0
    }
  },
  {
    "title": "A Hot Dog Is a Sandwich",
    "link": "2i5anybdkLktC1ie6Cmhni",
    "meta": {
      "rank": 31,
      "category": "Arts",
      "publisher": "Mythical",
      "description": "Mythical Chefs Josh Scherer and Nicole Enayati discuss, debate, and dissect the web’s most hilariously controversial culinary quandaries.",
      "image": "https://i.scdn.co/image/ab67656300005f1f24afe4d333cecc9f9040a7a8",
      "followers": 149924,
      "appleId": "id1500763931",
      "ratings": 3098,
      "velocity": 0
    }
  },
  {
    "title": "The Food Theorists (An Unofficial Podcast)",
    "link": "608ju1KQ9ebrQqzK1J8vx8",
    "meta": {
      "rank": 32,
      "category": "Arts",
      "publisher": "The Theorists",
      "description": "Hello Internet! My name is Meer, and I've made this unofficial Spotify podcast for you guys that can't watch MatPat's channel (The Food Theorists).  I Might make one of these for Game Theory and Film Theory.  If you have any problems please email me, My email is: meer.katurji@gmail.com  I might release this podcast for Google podcasts and make a discord server for the podcast   I Have released this podcast for apple podcasts   Link: https://podcasts.apple.com/us/podcast/the-food-theorists-an-unofficial-podcast/id1661442130  Thanks For Listening",
      "image": "https://i.scdn.co/image/ab67656300005f1f51845a6d107767a1f1030f69",
      "appleId": "id1661442130",
      "ratings": 7,
      "velocity": 7
    }
  },
  {
    "title": "Snap Judgment",
    "link": "3Cct7ZWmxHNAtLgBTqjC5v",
    "meta": {
      "rank": 33,
      "category": "Arts",
      "publisher": "Snap Judgment and PRX",
      "description": "Snap Judgment (Storytelling, with a BEAT) mixes real stories with killer beats to produce cinematic, dramatic, kick-ass radio. Snap’s raw, musical brand of storytelling dares listeners to see the world through the eyes of another.",
      "image": "https://i.scdn.co/image/d12304c1cb47e06ef5336e438c4b5663e0eb9ecd",
      "followers": 25922,
      "appleId": "id283657561",
      "ratings": 10315,
      "velocity": -1
    }
  },
  {
    "title": "The Stories We Tell with Joanna Gaines",
    "link": "1BKj2JdK4yAcz8PoqtXVeg",
    "meta": {
      "rank": 34,
      "category": "Arts",
      "publisher": "Blind Nil Audio and Pod People",
      "description": "New York Times Bestselling author Joanna Gaines invites guests - including podcast-reluctant Chip Gaines - to discuss her new book, The Stories We Tell. Filled with the same wit and hard-won wisdom you expect from the stars of Fixer Upper and Magnolia founders, this four-episode series shines a light on the vulnerable side of Jo as she speaks candidly about doubt and belief, shame and acceptance, and finding strength in self-discovery. Jo writes, “Earlier this year, I wrote down my story—all the people and places and moments from my life that shaped me. Some of it broke my heart, and some of it pieced it back together. But all of it made me surer than ever that the stories we tell—to ourselves and to each other—can heal, they can help us grow, and make us think. But mostly, stories are how we connect. That’s what led me to this podcast, to a place where we can share our stories together.” The series will feature solo conversations between Chip and Jo, along with other special guests, plus stories from others mixed in along the way. There is hope and power in living out the fullness of your story. But you don’t have to write it alone. New episodes every week in November!",
      "image": "https://i.scdn.co/image/ab67656300005f1f0423cda59386a659b5336071",
      "appleId": "id1652798324",
      "ratings": 394,
      "velocity": 0
    }
  },
  {
    "title": "Snap Judgment Presents: Spooked",
    "link": "76571Rfl3m7PLJQZKQIGCT",
    "meta": {
      "rank": 35,
      "category": "Arts",
      "publisher": "Snap Judgment",
      "description": "New episodes releasing every week. Spooked features true-life supernatural stories, told firsthand by people who can barely believe it happened themselves. Be afraid. Created in the dark of night, by Snap Judgment Studios, and hosted by Glynn Washington. Season 7 will be streaming  through Spring 2023.",
      "image": "https://i.scdn.co/image/ab67656300005f1fd6d2809ba4029cbdf6ebbdeb",
      "followers": 25922,
      "appleId": "id1279361017",
      "ratings": 13167,
      "velocity": 2
    }
  },
  {
    "title": "violet bent backwards over grass",
    "link": "4ErATnVbrb1xz49KOes0bx",
    "meta": {
      "rank": 36,
      "category": "Arts",
      "publisher": "vanaSa",
      "description": "lana’s poetry",
      "image": "https://i.scdn.co/image/ab67656300005f1fc371231c914eb6660f7c178f",
      "velocity": -8
    }
  },
  {
    "title": "MrCreepyPasta's Storytime",
    "link": "0smDmHOI9OND09y8cVoq2U",
    "meta": {
      "rank": 37,
      "category": "Arts",
      "publisher": "MrCreepyPasta",
      "description": "The OFFICIAL MrCreepyPasta Storytime!Hey there kids! It's me, MrCreepyPasta! And I think I might have found a new way to bring Creepypasta stories from the deep dark stones of the crypt and right to the ear balls in your head. If you're as excited as I am to hear a good story of terror and fear as I am then give me a subscription, hide under your blanket, and prepare yourself for some sweet dreams. Creepypasta Storytime is a collection of some of the most horrifying (and occasionally funny) stories, or Creepypastas, that the internet has to offer and narrated to you by the Blue Man himself. The podcast is taken directly from the YouTube channel of the same name and is always open to suggestions for new stories and submissions from you. mrcreepypasta@gmail.comSupport the podcast here: https://patreon.com/mrcreepypasta",
      "image": "https://i.scdn.co/image/5f263272a15fcadc506600a7367e2b11ae6900cc",
      "appleId": "id1086404799",
      "ratings": 2259,
      "velocity": 3
    }
  },
  {
    "title": "LA PLATICA",
    "link": "6pnkcvEvQeeNsSKFKtAXRn",
    "meta": {
      "rank": 38,
      "category": "Arts",
      "publisher": "LA PLATICA PODCAST",
      "description": "Nothing but the best guests and best talks! WELCOMETO LA PLATICA",
      "image": "https://i.scdn.co/image/ab67656300005f1ffff0cda535747c38a7f42be6",
      "appleId": "id1491416976",
      "ratings": 1669,
      "velocity": -11
    }
  },
  {
    "title": "The Next Great Read",
    "link": "6Gzo4TxlkBWyT9n1h6pdyw",
    "meta": {
      "rank": 39,
      "category": "Arts",
      "publisher": "The Next Great Read",
      "description": "Support this podcast   https://anchor.fm/tngr/support We're all about finding the next great read! Whether it's a debut novel or a hidden gem, we're here to help you discover your new favorite book. We also love promoting the work of emerging authors, so you can be sure to find some fresh new talent here as well (audio books, podcast, The Next Great Read, debut novel, hidden gem, emerging authors) #audio books free download #free audio books #audio books free #free audio books download #download audio books free Support this podcast: https://anchor.fm/tngr/support",
      "image": "https://i.scdn.co/image/ab67656300005f1f02ddca05192971523a2f24e3",
      "appleId": "id1540012994",
      "ratings": 10,
      "velocity": -5
    }
  },
  {
    "title": "Classic Audiobook Collection",
    "link": "0bYkBpWrkqU42rzYR6o0ri",
    "meta": {
      "rank": 40,
      "category": "Arts",
      "publisher": "Classic Literature",
      "description": "Classic audiobook collection of the great authors of all time. Explore the 800+ books that made these authors great. Full length audiobooks made available for free. Share us with friends and start a audiobook book club!",
      "image": "https://i.scdn.co/image/ab67656300005f1fed51da11fc3ebff6923a3e46",
      "appleId": "id1632083097",
      "ratings": 28,
      "velocity": 3
    }
  },
  {
    "title": "Scary Stories & Rain",
    "link": "6EVEYUdrCx4HCa16MZQdF3",
    "meta": {
      "rank": 41,
      "category": "Arts",
      "publisher": "Being Scared",
      "description": "TRUE scary stories and ambient rain sounds. Download the CHILLING app for more: http://chilling.app.link/chillingall Support this podcast: https://anchor.fm/being-scared/support",
      "image": "https://i.scdn.co/image/ec0e92979c3dc1da1b6d515619aec1f5c3801410",
      "velocity": 4
    }
  },
  {
    "title": "13 Reasons Why: The Tapes",
    "link": "1X1bJiKapf3jhgODiD3b2y",
    "meta": {
      "rank": 42,
      "category": "Arts",
      "publisher": "Abbi Colburn",
      "description": "The last time anyone heard this voice was when Hannah Baker was alive. I won’t divulge my reasons for posting these tapes and letting Hannah’s story be heard by the world... yet. But those of you who are on her list can probably guess why I’m doing this and that’s all that matters. For those of you who haven’t had your tape posted yet... stay tuned.",
      "image": "https://i.scdn.co/image/ab67656300005f1f2580d407eb37b88f4721ecbd",
      "velocity": 0
    }
  },
  {
    "title": "Random Shipping Forecast",
    "link": "61fn05IS5R9ugt5ECJanSb",
    "meta": {
      "rank": 43,
      "category": "Arts",
      "publisher": "Random Shipping Forecast",
      "description": "The Shipping Forecast is a BBC Radio broadcast of weather reports and forecasts for the seas around the coasts of the British Isles. This podcast consists of random shipping forecasts.  Contact: randomshippingforecast@gmail.com",
      "image": "https://i.scdn.co/image/ab67656300005f1fc73d91cbce5bbac1828d8e40",
      "appleId": "id1487560937",
      "ratings": 41,
      "velocity": 0
    }
  },
  {
    "title": "True scary stories",
    "link": "59k0UB1ybOVeEk23WYAMf6",
    "meta": {
      "rank": 44,
      "category": "Arts",
      "publisher": "True scary stories",
      "description": "If you enjoy scary stories as much as I do, then this is the place for you! Join me every night for new True scary stories that are sure to creep you out, and don't forget to press the bell icon for good measure!",
      "image": "https://i.scdn.co/image/ab67656300005f1f2e1c3932da87e832f61eebdd",
      "appleId": "id1587518345",
      "ratings": 654,
      "velocity": 2
    }
  },
  {
    "title": "top audiobooks",
    "link": "4lr5ICWPpXa3CtCexqyZXQ",
    "meta": {
      "rank": 45,
      "category": "Arts",
      "publisher": "Top Audiobooks",
      "description": "The main objective of Top audiobooks is to add knowledge to the listener in the periods when they are performing daily activities, such as: gym, driving, relaxing and, at the same time, adding fundamental values for the growth of their Mentality, Productivity and Interpersonal Intelligence.",
      "image": "https://i.scdn.co/image/ab67656300005f1f8eba3f7de0bdf4abc6c91a6b",
      "appleId": "id1636968869",
      "ratings": 1,
      "velocity": -3
    }
  },
  {
    "title": "Pastora Yesenia Then",
    "link": "47SvLma45kOiCjWgO25eRU",
    "meta": {
      "rank": 46,
      "category": "Arts",
      "publisher": "Pastora Yesenia Then",
      "description": "Es pastora, maestra, evangelista internacional, inspiradora, llamada por Dios. Conocida por llevar un mensaje de vida, restauración y esperanza a las naciones.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9a161d8047390aedc0898101",
      "appleId": "id1523101152",
      "ratings": 18,
      "velocity": -11
    }
  },
  {
    "title": "House of Herby",
    "link": "0XiRgvzqmDshfIKNQwsnGG",
    "meta": {
      "rank": 47,
      "category": "Arts",
      "publisher": "Qveen Herby",
      "description": "Music artists Qveen Herby and Jedi Nick invite us into their safe space for self-discovery. This podcast explores the ups and downs of creative living, delivered like a pep-talk from your besties. Get your weekly motivation and permission to go after your wildest dreams with a side of witchy chaos.",
      "image": "https://i.scdn.co/image/ab67656300005f1f9d3932e3f9d717342246be14",
      "velocity": 2
    }
  },
  {
    "title": "videos bc why not lol",
    "link": "3S2HqkfaBM1VsiUZthwMfF",
    "meta": {
      "rank": 48,
      "category": "Arts",
      "publisher": "Maidskiii",
      "description": "Hi! My name is auggie  I will try to post as much as possible but i might take some breaks once in awhile I will not be posting any furry, gacha, or age regression tiktoks Spotify account: Maidskiii💀💀",
      "image": "https://i.scdn.co/image/ab67656300005f1f2b936ccddcc08748012ab0fd",
      "velocity": -4
    }
  },
  {
    "title": "Manacled Audiobook | Audio Dinos + Audiobook Warriors",
    "link": "7AqtWVRrnUR3t5rM6eVZRR",
    "meta": {
      "rank": 49,
      "category": "Arts",
      "publisher": "The Nooblifer",
      "description": "The Audiobook of The Manacled Fanfiction by Senlinyu.  Support my work, buy me a coffee :) - https://ko-fi.com/thenooblifer  Harry Potter is dead. In the aftermath of the war, in order to strengthen the might of the magical world, Voldemort enacts a repopulation effort. Hermione Granger has an Order secret, lost but hidden in her mind, so she is sent as an enslaved surrogate to the High Reeve, to be bred and monitored until her mind can be cracked.  Tumblr - thenooblifer , Insta - AudioDinos",
      "image": "https://i.scdn.co/image/ab67656300005f1fef9ad8355b1740b89e2eb9b3",
      "velocity": 0
    }
  },
  {
    "title": "Longer Tables with José Andrés",
    "link": "503IMoVqjrfk7m1kbNpPsc",
    "meta": {
      "rank": 50,
      "category": "Arts",
      "publisher": "José Andrés",
      "description": "Longer Tables with José Andrés explores all the ways that food shapes our world and makes us who we are. In each episode, José talks to friends from the worlds of culinary and creative arts, politics, and media: Stacey Abrams, Ron Howard, Yo-Yo Ma, Eric Ripert, and Liev Schreiber, and more. He also takes listeners into his home kitchen to learn his favorite recipes, and answers their burning culinary questions.  joseandres.substack.com",
      "image": "https://i.scdn.co/image/ab67656300005f1f5ecd12302e7120159c57ac5e",
      "followers": 1175343,
      "appleId": "id1642369862",
      "ratings": 170,
      "velocity": -3
    }
  }
]